-- phpMyAdmin SQL Dump

-- version 4.0.10deb1

-- http://www.phpmyadmin.net

--

-- Host: localhost

-- Generation Time: Jul 02, 2014 at 11:25 PM

-- Server version: 5.5.37-0ubuntu0.14.04.1

-- PHP Version: 5.5.9-1ubuntu4.2



SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";

SET time_zone = "+00:00";





/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;

/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;

/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;

/*!40101 SET NAMES utf8 */;



--

-- Database: `villes_tests`

--



-- --------------------------------------------------------



--

-- Table structure for table `villes_france_free`

--



CREATE TABLE IF NOT EXISTS `villes_france_free` (

  `ville_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,

  `ville_departement` varchar(3) DEFAULT NULL,

  `ville_slug` varchar(255) DEFAULT NULL,

  `ville_nom` varchar(45) DEFAULT NULL,

  `ville_nom_simple` varchar(45) DEFAULT NULL,

  `ville_nom_reel` varchar(45) DEFAULT NULL,

  `ville_nom_soundex` varchar(20) DEFAULT NULL,

  `ville_nom_metaphone` varchar(22) DEFAULT NULL,

  `ville_code_postal` varchar(255) DEFAULT NULL,

  `ville_commune` varchar(3) DEFAULT NULL,

  `ville_code_commune` varchar(5) NOT NULL,

  `ville_arrondissement` smallint(3) unsigned DEFAULT NULL,

  `ville_canton` varchar(4) DEFAULT NULL,

  `ville_amdi` smallint(5) unsigned DEFAULT NULL,

  `ville_population_2010` mediumint(11) unsigned DEFAULT NULL,

  `ville_population_1999` mediumint(11) unsigned DEFAULT NULL,

  `ville_population_2012` mediumint(10) unsigned DEFAULT NULL COMMENT 'approximatif',

  `ville_densite_2010` int(11) DEFAULT NULL,

  `ville_surface` float DEFAULT NULL,

  `ville_longitude_deg` float DEFAULT NULL,

  `ville_latitude_deg` float DEFAULT NULL,

  `ville_longitude_grd` varchar(9) DEFAULT NULL,

  `ville_latitude_grd` varchar(8) DEFAULT NULL,

  `ville_longitude_dms` varchar(9) DEFAULT NULL,

  `ville_latitude_dms` varchar(8) DEFAULT NULL,

  `ville_zmin` mediumint(4) DEFAULT NULL,

  `ville_zmax` mediumint(4) DEFAULT NULL,

  PRIMARY KEY (`ville_id`),

  UNIQUE KEY `ville_code_commune_2` (`ville_code_commune`),

  UNIQUE KEY `ville_slug` (`ville_slug`),

  KEY `ville_departement` (`ville_departement`),

  KEY `ville_nom` (`ville_nom`),

  KEY `ville_nom_reel` (`ville_nom_reel`),

  KEY `ville_code_commune` (`ville_code_commune`),

  KEY `ville_code_postal` (`ville_code_postal`),

  KEY `ville_longitude_latitude_deg` (`ville_longitude_deg`,`ville_latitude_deg`),

  KEY `ville_nom_soundex` (`ville_nom_soundex`),

  KEY `ville_nom_metaphone` (`ville_nom_metaphone`),

  KEY `ville_population_2010` (`ville_population_2010`),

  KEY `ville_nom_simple` (`ville_nom_simple`)

) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=36831 ;



--

-- Dumping data for table `villes_france_free`

--



INSERT INTO `villes_france_free` (`ville_id`, `ville_departement`, `ville_slug`, `ville_nom`, `ville_nom_simple`, `ville_nom_reel`, `ville_nom_soundex`, `ville_nom_metaphone`, `ville_code_postal`, `ville_commune`, `ville_code_commune`, `ville_arrondissement`, `ville_canton`, `ville_amdi`, `ville_population_2010`, `ville_population_1999`, `ville_population_2012`, `ville_densite_2010`, `ville_surface`, `ville_longitude_deg`, `ville_latitude_deg`, `ville_longitude_grd`, `ville_latitude_grd`, `ville_longitude_dms`, `ville_latitude_dms`, `ville_zmin`, `ville_zmax`) VALUES

(1, '01', 'ozan', 'OZAN', 'ozan', 'Ozan', 'O250', 'OSN', '01190', '284', '01284', 2, '26', 6, 618, 469, 500, 93, 6.6, 4.91667, 46.3833, '2866', '51546', '+45456', '462330', 170, 205),

(2, '01', 'cormoranche-sur-saone', 'CORMORANCHE-SUR-SAONE', 'cormoranche sur saone', 'Cormoranche-sur-Saône', 'C65652625', 'KRMRNXSRSN', '01290', '123', '01123', 2, '27', 6, 1058, 903, 1000, 107, 9.85, 4.83333, 46.2333, '2772', '51379', '+44953', '461427', 168, 211),

(3, '01', 'plagne-01', 'PLAGNE', 'plagne', 'Plagne', 'P425', 'PLKN', '01130', '298', '01298', 4, '03', 6, 129, 83, 100, 20, 6.2, 5.73333, 46.1833, '3769', '51324', '+54342', '461131', 560, 922),

(4, '01', 'tossiat', 'TOSSIAT', 'tossiat', 'Tossiat', 'T230', 'TST', '01250', '422', '01422', 2, '25', 6, 1406, 1111, 1400, 138, 10.17, 5.31667, 46.1333, '3309', '51268', '+51854', '460828', 244, 501),

(5, '01', 'pouillat', 'POUILLAT', 'pouillat', 'Pouillat', 'P430', 'PLT', '01250', '309', '01309', 2, '33', 6, 88, 58, 100, 14, 6.23, 5.43333, 46.3333, '3435', '51475', '+52542', '461938', 333, 770),

(6, '01', 'torcieu', 'TORCIEU', 'torcieu', 'Torcieu', 'T620', 'TRS', '01230', '421', '01421', 1, '28', 6, 698, 643, 700, 65, 10.72, 5.4, 45.9167, '3398', '51025', '+52343', '455521', 257, 782),

(7, '01', 'replonges', 'REPLONGES', 'replonges', 'Replonges', 'R1452', 'RPLNJS', '01620', '320', '01320', 2, '02', 6, 3500, 2841, 3300, 210, 16.6, 4.88333, 46.3, '2833', '51456', '+45310', '461837', 169, 207),

(8, '01', 'corcelles', 'CORCELLES', 'corcelles', 'Corcelles', 'C6242', 'KRSLS', '01110', '119', '01119', 4, '06', 6, 243, 222, 200, 17, 14.16, 5.58333, 46.0333, '3597', '51151', '+53428', '460208', 780, 1081),

(9, '01', 'peron', 'PERON', 'peron', 'Péron', 'P650', 'PRN', '01630', '288', '01288', 3, '12', 6, 2143, 1578, 1900, 82, 26.01, 5.93333, 46.2, '3989', '51322', '+55535', '461124', 411, 1501),

(10, '01', 'relevant', 'RELEVANT', 'relevant', 'Relevant', 'R4153', 'RLFNT', '01990', '319', '01319', 2, '30', 6, 466, 367, 400, 37, 12.38, 4.95, 46.0833, '2903', '51211', '+45658', '460525', 235, 282),

(11, '01', 'chaveyriat', 'CHAVEYRIAT', 'chaveyriat', 'Chaveyriat', 'C163', 'XFRT', '01660', '096', '01096', 2, '10', 6, 927, 810, 900, 54, 16.87, 5.06667, 46.1833, '3026', '51331', '+50338', '461152', 188, 260),

(12, '01', 'vaux-en-bugey', 'VAUX-EN-BUGEY', 'vaux en bugey', 'Vaux-en-Bugey', 'V2512', 'FKSNBJ', '01150', '431', '01431', 1, '17', 6, 1169, 1003, 1100, 142, 8.22, 5.35, 45.9167, '3352', '51031', '+52113', '455541', 252, 681),

(13, '01', 'maillat', 'MAILLAT', 'maillat', 'Maillat', 'M430', 'MLT', '01430', '228', '01228', 4, '22', 6, 668, 664, 700, 59, 11.31, 5.55, 46.1333, '3557', '51255', '+53217', '460745', 497, 825),

(14, '01', 'faramans-01', 'FARAMANS', 'faramans', 'Faramans', 'F652', 'FRMNS', '01800', '156', '01156', 2, '19', 6, 681, 591, 600, 60, 11.22, 5.11667, 45.9, '3099', '51002', '+50732', '455407', 255, 306),

(15, '01', 'beon-01', 'BEON', 'beon', 'Béon', 'B500', 'BN', '01350', '039', '01039', 1, '09', 6, 373, 364, 400, 36, 10.3, 5.75, 45.8333, '3798', '50950', '+54519', '455117', 228, 1412),

(16, '01', 'saint-bernard-01', 'SAINT-BERNARD', 'saint bernard', 'Saint-Bernard', 'S5316563', 'SNTBRNRT', '01600', '339', '01339', 2, '34', 6, 1375, 1281, 1400, 436, 3.15, 4.73723, 45.945, '2667', '51050', '+44414', '455642', 167, 198),

(17, '01', 'rossillon', 'ROSSILLON', 'rossillon', 'Rossillon', 'R245', 'RSLN', '01510', '329', '01329', 1, '36', 6, 148, 147, 100, 18, 8.07, 5.6, 45.8333, '3619', '50924', '+53537', '454955', 324, 1022),

(18, '01', 'pont-d-ain', 'PONT-D''AIN', 'pont d ain', 'Pont-d''Ain', 'P535', 'PNTTN', '01160', '304', '01304', 2, '25', 5, 2627, 2309, 2500, 234, 11.22, 5.33333, 46.05, '3333', '51165', '+52011', '460254', 232, 314),

(19, '01', 'nantua', 'NANTUA', 'nantua', 'Nantua', 'N300', 'NNT', '01460', '269', '01269', 4, '22', 4, 3713, 3922, 3600, 290, 12.79, 5.61667, 46.15, '3633', '51282', '+53622', '460912', 427, 1125),

(20, '01', 'chavannes-sur-reyssouze', 'CHAVANNES-SUR-REYSSOUZE', 'chavannes sur reyssouze', 'Chavannes-sur-Reyssouze', 'C15262', 'XFNSSRRSS', '01190', '094', '01094', 2, '26', 6, 680, 580, 700, 41, 16.55, 5, 46.4333, '2952', '51590', '+45935', '462550', 175, 218),

(21, '01', 'neuville-les-dames', 'NEUVILLE-LES-DAMES', 'neuville les dames', 'Neuville-les-Dames', 'N142352', 'NFLLSTMS', '01400', '272', '01272', 2, '10', 6, 1504, 1232, 1500, 56, 26.59, 5, 46.1667, '2963', '51291', '+50013', '460944', 210, 271),

(22, '01', 'flaxieu', 'FLAXIEU', 'flaxieu', 'Flaxieu', 'F420', 'FLKS', '01350', '162', '01162', 1, '36', 6, 63, 50, 100, 22, 2.79, 5.73333, 45.8167, '3776', '50898', '+54407', '454830', 225, 385),

(23, '01', 'hotonnes', 'HOTONNES', 'hotonnes', 'Hotonnes', 'H352', 'HTNS', '01260', '187', '01187', 4, '06', 6, 306, 295, 300, 10, 28.4, 5.68333, 46, '3730', '51109', '+54136', '455952', 636, 1338),

(24, '01', 'saint-sorlin-en-bugey', 'SAINT-SORLIN-EN-BUGEY', 'saint sorlin en bugey', 'Saint-Sorlin-en-Bugey', 'S53264512', 'SNTSRLNNBJ', '01150', '386', '01386', 1, '17', 6, 1061, 938, 1100, 116, 9.07, 5.36667, 45.8833, '3371', '50983', '+52214', '455306', 196, 700),

(25, '01', 'songieu', 'SONGIEU', 'songieu', 'Songieu', 'S520', 'SNJ', '01260', '409', '01409', 1, '09', 6, 130, 123, 100, 6, 20.58, 5.7, 45.9667, '3740', '51082', '+54208', '455824', 567, 1275),

(26, '01', 'virieu-le-petit', 'VIRIEU-LE-PETIT', 'virieu le petit', 'Virieu-le-Petit', 'V6413', 'FRLPTT', '01260', '453', '01453', 1, '09', 6, 309, 281, 300, 18, 16.36, 5.71667, 45.9, '3764', '51010', '+54328', '455431', 419, 1524),

(27, '01', 'saint-denis-en-bugey', 'SAINT-DENIS-EN-BUGEY', 'saint denis en bugey', 'Saint-Denis-en-Bugey', 'S5352512', 'SNTTNSNBJ', '01500', '345', '01345', 1, '01', 6, 2178, 1939, 2100, 834, 2.61, 5.33333, 45.95, '3325', '51058', '+51945', '455707', 234, 338),

(28, '01', 'charnoz-sur-ain', 'CHARNOZ-SUR-AIN', 'charnoz sur ain', 'Charnoz-sur-Ain', 'C65265', 'XRNSSRN', '01800', '088', '01088', 2, '19', 6, 911, 808, 900, 137, 6.62, 5.21667, 45.8667, '3206', '50969', '+51318', '455220', 203, 244),

(29, '01', 'chazey-sur-ain', 'CHAZEY-SUR-AIN', 'chazey sur ain', 'Chazey-sur-Ain', 'C650', 'XSSRN', '01150', '099', '01099', 1, '17', 6, 1464, 1200, 1400, 66, 21.95, 5.25, 45.9, '3242', '50992', '+51516', '455333', 202, 261),

(30, '01', 'marchamp', 'MARCHAMP', 'marchamp', 'Marchamp', 'M6251', 'MRXMP', '01680', '233', '01233', 1, '18', 6, 118, 108, 100, 9, 13.11, 5.55, 45.7833, '3561', '50874', '+53230', '454712', 400, 940),

(31, '01', 'culoz', 'CULOZ', 'culoz', 'Culoz', 'C420', 'KLS', '01350', '138', '01138', 1, '31', 6, 2909, 2620, 2900, 150, 19.36, 5.78333, 45.85, '3828', '50943', '+54654', '455055', 226, 1430),

(32, '01', 'mantenay-montlin', 'MANTENAY-MONTLIN', 'mantenay montlin', 'Mantenay-Montlin', 'M35345', 'MNTNMNTLN', '01560', '230', '01230', 2, '29', 6, 288, 247, 300, 26, 10.8, 5.08333, 46.4167, '3068', '51583', '+50554', '462528', 180, 222),

(33, '01', 'marboz', 'MARBOZ', 'marboz', 'Marboz', 'M612', 'MRBS', '01851', '232', '01232', 2, '11', 6, 2182, 2164, 2200, 54, 40.14, 5.25, 46.3333, '3246', '51492', '+51530', '462033', 194, 240),

(34, '01', 'foissiat', 'FOISSIAT', 'foissiat', 'Foissiat', 'F230', 'FST', '01340', '163', '01163', 2, '21', 6, 1912, 1562, 1900, 47, 40.36, 5.18333, 46.3667, '3153', '51523', '+51029', '462213', 186, 228),

(35, '01', 'treffort-cuisiat', 'TREFFORT-CUISIAT', 'treffort cuisiat', 'Treffort-Cuisiat', 'T616323', 'TRFRTKXT', '01370', '426', '01426', 2, '33', 5, 2204, 1908, 2100, 55, 39.41, 5.36834, 46.2714, '3369', '51413', '+52206', '461617', 221, 681),

(36, '01', 'izieu', 'IZIEU', 'izieu', 'Izieu', 'I200', 'IS', '01300', '193', '01193', 1, '04', 6, 201, 178, 200, 26, 7.67, 5.63333, 45.65, '3674', '50727', '+53837', '453917', 211, 758),

(37, '01', 'saint-etienne-du-bois-01', 'SAINT-ETIENNE-DU-BOIS', 'saint etienne du bois', 'Saint-Étienne-du-Bois', 'S535312', 'SNTTNTBS', '01370', '350', '01350', 2, '33', 6, 2441, 2045, 2400, 86, 28.38, 5.28333, 46.2833, '3285', '51431', '+51736', '461717', 213, 259),

(38, '01', 'hauteville-lompnes', 'HAUTEVILLE-LOMPNES', 'hauteville lompnes', 'Hauteville-Lompnes', 'H3145152', 'HTFLLMPNS', '01110', '185', '01185', 1, '15', 5, 4044, 3653, 4200, 80, 50.34, 5.6, 45.9667, '3625', '51088', '+53558', '455844', 455, 1240),

(39, '01', 'saint-trivier-sur-moignans', 'SAINT-TRIVIER-SUR-MOIGNANS', 'saint trivier sur moignans', 'Saint-Trivier-sur-Moignans', 'S53616265252', 'SNTTRFRSRMKNNS', '01990', '389', '01389', 2, '30', 5, 1877, 1537, 1900, 44, 41.99, 4.9, 46.0667, '2846', '51193', '+45354', '460424', 230, 289),

(40, '01', 'peyriat', 'PEYRIAT', 'peyriat', 'Peyriat', 'P630', 'PRT', '01430', '293', '01293', 4, '16', 6, 171, 157, 200, 28, 5.96, 5.51667, 46.15, '3526', '51282', '+53037', '460915', 558, 825),

(41, '01', 'evosges', 'EVOSGES', 'evosges', 'Évosges', 'E120', 'EFSJS', '01230', '155', '01155', 1, '28', 6, 140, 109, 100, 11, 12.08, 5.5, 45.9583, '3513', '51068', '+52953', '455739', 560, 1001),

(42, '01', 'poncin', 'PONCIN', 'poncin', 'Poncin', 'P525', 'PNSN', '01450', '303', '01303', 4, '24', 5, 1644, 1371, 1600, 83, 19.77, 5.4, 46.0833, '3411', '51206', '+52424', '460506', 240, 540),

(43, '01', 'crans-01', 'CRANS', 'crans', 'Crans', 'C652', 'KRNS', '01320', '129', '01129', 2, '08', 6, 269, 258, 300, 20, 13.23, 5.21667, 45.9667, '3171', '51072', '+51126', '455754', 249, 322),

(44, '01', 'montreal-la-cluse', 'MONTREAL-LA-CLUSE', 'montreal la cluse', 'Montréal-la-Cluse', 'M364242', 'MNTRLLKLS', '01460', '265', '01265', 4, '22', 6, 3457, 3699, 3500, 269, 12.83, 5.57084, 46.1867, '3593', '51319', '+53415', '461112', 473, 960),

(45, '01', 'cleyzieu', 'CLEYZIEU', 'cleyzieu', 'Cleyzieu', 'C420', 'KLS', '01230', '107', '01107', 1, '28', 6, 135, 116, 100, 17, 7.82, 5.43333, 45.9, '3438', '51009', '+52550', '455428', 440, 927),

(46, '01', 'lompnieu', 'LOMPNIEU', 'lompnieu', 'Lompnieu', 'L515', 'LMPN', '01260', '221', '01221', 1, '09', 6, 122, 103, 100, 10, 11.35, 5.65, 45.9667, '3693', '51069', '+53939', '455742', 524, 1241),

(47, '01', 'villereversure', 'VILLEREVERSURE', 'villereversure', 'Villereversure', 'V461626', 'FLRFRSR', '01250', '447', '01447', 2, '07', 6, 1208, 1102, 1200, 69, 17.45, 5.38333, 46.1833, '3400', '51324', '+52346', '461131', 279, 480),

(48, '01', 'saint-martin-du-mont-01', 'SAINT-MARTIN-DU-MONT', 'saint martin du mont', 'Saint-Martin-du-Mont', 'S535635353', 'SNTMRTNTMNT', '01160', '374', '01374', 2, '25', 6, 1651, 1304, 1600, 58, 28.09, 5.33333, 46.1, '3324', '51224', '+51942', '460606', 246, 556),

(49, '01', 'saint-genis-pouilly', 'SAINT-GENIS-POUILLY', 'saint genis pouilly', 'Saint-Genis-Pouilly', 'S5325214', 'SNTJNSPL', '01630', '354', '01354', 3, '13', 6, 8914, 6382, 8400, 912, 9.77, 6.01667, 46.25, '4094', '51382', '+60117', '461436', 419, 502),

(50, '01', 'bolozon', 'BOLOZON', 'bolozon', 'Bolozon', 'B425', 'BLSN', '01450', '051', '01051', 4, '16', 6, 94, 94, 100, 19, 4.92, 5.48333, 46.2, '3486', '51325', '+52828', '461134', 261, 673),

(51, '01', 'confrancon', 'CONFRANCON', 'confrancon', 'Confrançon', 'C516525', 'KNFRNKN', '01310', '115', '01115', 2, '21', 6, 1157, 862, 1100, 63, 18.17, 5.06667, 46.2667, '3032', '51408', '+50355', '461602', 192, 224),

(52, '01', 'lochieu', 'LOCHIEU', 'lochieu', 'Lochieu', 'L200', 'LX', '01260', '218', '01218', 1, '09', 6, 91, 73, 100, 12, 7.07, 5.71667, 45.9333, '3768', '51034', '+54340', '455550', 479, 1426),

(53, '01', 'chanoz-chatenay', 'CHANOZ-CHATENAY', 'chanoz chatenay', 'Chanoz-Châtenay', 'C5235', 'XNSXTN', '01400', '084', '01084', 2, '10', 6, 706, 492, 700, 52, 13.42, 5.03333, 46.1833, '2993', '51316', '+50148', '461103', 194, 268),

(54, '01', 'villebois', 'VILLEBOIS', 'villebois', 'Villebois', 'V412', 'FLBS', '01150', '444', '01444', 1, '17', 6, 1153, 953, 1100, 79, 14.46, 5.43333, 45.85, '3443', '50942', '+52606', '455052', 195, 960),

(55, '01', 'ceignes', 'CEIGNES', 'ceignes', 'Ceignes', 'C520', 'SKNS', '01430', '067', '01067', 4, '16', 6, 265, 229, 300, 26, 10.01, 5.5, 46.1167, '3514', '51245', '+52957', '460713', 580, 862),

(56, '01', 'saint-didier-sur-chalaronne', 'SAINT-DIDIER-SUR-CHALARONNE', 'saint didier sur chalaronne', 'Saint-Didier-sur-Chalaronne', 'S536262465', 'SNTTTRSRXLRN', '01140', '348', '01348', 2, '32', 6, 2776, 2263, 2700, 111, 24.98, 4.81667, 46.1667, '2757', '51308', '+44904', '461039', 167, 223),

(57, '01', 'revonnas', 'REVONNAS', 'revonnas', 'Revonnas', 'R152', 'RFNS', '01250', '321', '01321', 2, '07', 6, 788, 493, 700, 101, 7.75, 5.33333, 46.1667, '3326', '51291', '+51949', '460944', 255, 504),

(58, '01', 'bourg-saint-christophe', 'BOURG-SAINT-CHRISTOPHE', 'bourg saint christophe', 'Bourg-Saint-Christophe', 'B625326231', 'BRKSNTXRSTF', '01800', '054', '01054', 2, '19', 6, 1173, 824, 1100, 130, 8.98, 5.16667, 45.8833, '3138', '50990', '+50938', '455326', 207, 305),

(59, '01', 'condeissiat', 'CONDEISSIAT', 'condeissiat', 'Condeissiat', 'C5323', 'KNTST', '01400', '113', '01113', 2, '10', 6, 756, 649, 700, 34, 21.64, 5.08333, 46.1667, '3048', '51287', '+50448', '460930', 232, 268),

(60, '01', 'pirajoux', 'PIRAJOUX', 'pirajoux', 'Pirajoux', 'P620', 'PRJKS', '01270', '296', '01296', 2, '11', 6, 360, 299, 300, 27, 12.99, 5.3, 46.3833, '3292', '51524', '+51757', '462217', 192, 237),

(61, '01', 'chalamont', 'CHALAMONT', 'chalamont', 'Chalamont', 'C453', 'XLMNT', '01320', '074', '01074', 2, '08', 5, 2322, 1656, 2200, 70, 32.88, 5.16667, 46, '3149', '51107', '+51016', '455946', 269, 330),

(62, '01', 'plantay', 'LE PLANTAY', 'le plantay', 'Le Plantay', 'L1453', 'LPLNT', '01330', '299', '01299', 2, '08', 6, 540, 416, 500, 27, 19.96, 5.08333, 46.0167, '3058', '51137', '+50520', '460123', 267, 286),

(63, '01', 'versailleux', 'VERSAILLEUX', 'versailleux', 'Versailleux', 'V6242', 'FRSLKS', '01330', '434', '01434', 2, '08', 6, 332, 254, 300, 17, 18.77, 5.1, 45.9833, '3075', '51089', '+50614', '455849', 274, 303),

(64, '01', 'montagnat', 'MONTAGNAT', 'montagnat', 'Montagnat', 'M3253', 'MNTKNT', '01250', '254', '01254', 2, '39', 6, 1646, 1421, 1600, 119, 13.75, 5.28333, 46.1667, '3275', '51301', '+51703', '461015', 229, 282),

(65, '01', 'vieu', 'VIEU', 'vieu', 'Vieu', 'V000', 'F', '01260', '442', '01442', 1, '09', 6, 380, 311, 400, 58, 6.54, 5.68333, 45.9, '3717', '50990', '+54054', '455326', 280, 540),

(66, '01', 'saint-andre-de-corcy', 'SAINT-ANDRE-DE-CORCY', 'saint andre de corcy', 'Saint-André-de-Corcy', 'S535363262', 'SNTNTRTKRS', '01390', '333', '01333', 2, '42', 6, 2991, 3098, 3000, 144, 20.73, 4.95, 45.9167, '2906', '51029', '+45708', '455535', 279, 306),

(67, '01', 'bressolles-01', 'BRESSOLLES', 'bressolles', 'Bressolles', 'B6242', 'BRSLS', '01360', '062', '01062', 2, '20', 6, 709, 587, 700, 91, 7.73, 5.1, 45.8667, '3065', '50963', '+50544', '455201', 205, 292),

(68, '01', 'peronnas', 'PERONNAS', 'peronnas', 'Péronnas', 'P652', 'PRNS', '01960', '289', '01289', 2, '39', 5, 6054, 5530, 6100, 344, 17.55, 5.2, 46.1833, '3184', '51309', '+51210', '461043', 223, 277),

(69, '01', 'colomieu', 'COLOMIEU', 'colomieu', 'Colomieu', 'C450', 'KLM', '01300', '110', '01110', 1, '04', 6, 115, 128, 100, 19, 5.96, 5.61667, 45.7333, '3650', '50814', '+53719', '454359', 319, 476),

(70, '01', 'monthieux', 'MONTHIEUX', 'monthieux', 'Monthieux', 'M320', 'MN0KS', '01390', '261', '01261', 2, '35', 6, 599, 579, 600, 55, 10.75, 4.93333, 45.95, '2893', '51064', '+45625', '455726', 281, 311),

(71, '01', 'saint-jean-sur-reyssouze', 'SAINT-JEAN-SUR-REYSSOUZE', 'saint jean sur reyssouze', 'Saint-Jean-sur-Reyssouze', 'S5325262', 'SNTJNSRRSS', '01560', '364', '01364', 2, '29', 6, 744, 582, 700, 27, 27.48, 5.06667, 46.4, '3029', '51551', '+50346', '462346', 178, 218),

(72, '01', 'garnerans', 'GARNERANS', 'garnerans', 'Garnerans', 'G65652', 'KRNRNS', '01140', '167', '01167', 2, '32', 6, 656, 565, 600, 76, 8.57, 4.83333, 46.2, '2783', '51340', '+45028', '461221', 168, 215),

(73, '01', 'montrevel-en-bresse', 'MONTREVEL-EN-BRESSE', 'montrevel en bresse', 'Montrevel-en-Bresse', 'M36145162', 'MNTRFLNBRS', '01340', '266', '01266', 2, '21', 5, 2362, 1995, 2400, 229, 10.27, 5.13333, 46.3333, '3102', '51485', '+50742', '462012', 192, 220),

(74, '01', 'conand', 'CONAND', 'conand', 'Conand', 'C530', 'KNNT', '01230', '111', '01111', 1, '28', 6, 104, 69, 100, 6, 15.28, 5.46667, 45.8833, '3483', '50992', '+52816', '455333', 351, 1021),

(75, '01', 'challes-la-montagne', 'CHALLES-LA-MONTAGNE', 'challes la montagne', 'Challes-la-Montagne', 'C4245325', 'XLSLMNTKN', '01450', '077', '01077', 4, '24', 6, 179, 203, 200, 23, 7.65, 5.46667, 46.1333, '3475', '51250', '+52752', '460730', 440, 700),

(76, '01', 'mogneneins', 'MOGNENEINS', 'mogneneins', 'Mogneneins', 'M252', 'MKNNNS', '01140', '252', '01252', 2, '32', 6, 727, 572, 700, 84, 8.57, 4.81667, 46.1333, '2750', '51265', '+44842', '460818', 168, 238),

(77, '01', 'thoissey', 'THOISSEY', 'thoissey', 'Thoissey', 'T200', '0S', '01140', '420', '01420', 2, '32', 5, 1540, 1355, 1500, 1149, 1.34, 4.8, 46.1667, '2739', '51303', '+44807', '461021', 168, 178),

(78, '01', 'chaleins', 'CHALEINS', 'chaleins', 'Chaleins', 'C452', 'XLNS', '01480', '075', '01075', 2, '30', 6, 1165, 1025, 1200, 68, 17, 4.8, 46.0333, '2742', '51145', '+44817', '460150', 193, 267),

(79, '01', 'neuville-sur-ain', 'NEUVILLE-SUR-AIN', 'neuville sur ain', 'Neuville-sur-Ain', 'N14265', 'NFLSRN', '01160', '273', '01273', 2, '25', 6, 1571, 1237, 1500, 79, 19.79, 5.36667, 46.0833, '3373', '51203', '+52220', '460457', 242, 427),

(80, '01', 'thil-01', 'THIL', 'thil', 'Thil', 'T400', '0L', '01120', '418', '01418', 2, '40', 6, 1070, 946, 1100, 207, 5.15, 5.01667, 45.8167, '2983', '50905', '+50118', '454851', 174, 183),

(81, '01', 'jujurieux', 'JUJURIEUX', 'jujurieux', 'Jujurieux', 'J620', 'JJRKS', '01640', '199', '01199', 4, '24', 6, 2097, 1696, 2000, 136, 15.39, 5.41667, 46.0333, '3414', '51156', '+52432', '460224', 242, 633),

(82, '01', 'oncieu', 'ONCIEU', 'oncieu', 'Oncieu', 'O520', 'ONS', '01230', '279', '01279', 1, '28', 6, 91, 78, 100, 11, 7.76, 5.46667, 45.95, '3485', '51066', '+52824', '455733', 300, 807),

(83, '01', 'lurcy', 'LURCY', 'lurcy', 'Lurcy', 'L620', 'LRS', '01090', '225', '01225', 2, '30', 6, 393, 256, 400, 81, 4.81, 4.76667, 46.0667, '2716', '51181', '+44652', '460346', 169, 233),

(84, '01', 'balan-01', 'BALAN', 'balan', 'Balan', 'B450', 'BLN', '01360', '027', '01027', 2, '20', 6, 2348, 1534, 2400, 130, 18.04, 5.1, 45.8333, '3069', '50927', '+50554', '455003', 178, 233),

(85, '01', 'ambutrix', 'AMBUTRIX', 'ambutrix', 'Ambutrix', 'A51362', 'AMTRKS', '01500', '008', '01008', 1, '17', 6, 729, 586, 700, 139, 5.22, 5.33333, 45.9333, '3335', '51044', '+52017', '455621', 237, 370),

(86, '01', 'sainte-croix-01', 'SAINTE-CROIX', 'sainte croix', 'Sainte-Croix', 'S53262', 'SNTKRKS', '01120', '342', '01342', 2, '20', 6, 534, 468, 500, 50, 10.62, 5.05195, 45.8942, '3017', '50994', '+50307', '455339', 229, 294),

(87, '01', 'blyes', 'BLYES', 'blyes', 'Blyes', 'B420', 'BLYS', '01150', '047', '01047', 1, '17', 6, 886, 691, 900, 95, 9.32, 5.25, 45.85, '3236', '50941', '+51458', '455049', 199, 243),

(88, '01', 'conzieu', 'CONZIEU', 'conzieu', 'Conzieu', 'C520', 'KNS', '01300', '117', '01117', 1, '04', 6, 135, 99, 100, 18, 7.2, 5.6, 45.7333, '3634', '50807', '+53626', '454334', 311, 1020),

(89, '01', 'nievroz', 'NIEVROZ', 'nievroz', 'Niévroz', 'N162', 'NFRS', '01120', '276', '01276', 2, '20', 6, 1488, 1359, 1500, 142, 10.46, 5.06667, 45.8333, '3030', '50918', '+50350', '454935', 175, 197),

(90, '01', 'nurieux-volognat', 'NURIEUX-VOLOGNAT', 'nurieux volognat', 'Nurieux-Volognat', 'N6214253', 'NRKSFLKNT', '01460', '267', '01267', 4, '16', 6, 1058, 952, 1100, 54, 19.34, 5.52667, 46.1856, '3544', '51317', '+53136', '461108', 448, 840),

(91, '01', 'ambleon', 'AMBLEON', 'ambleon', 'Ambléon', 'A5145', 'AMLN', '01300', '006', '01006', 1, '04', 6, 116, 86, 100, 19, 5.88, 5.6, 45.75, '3627', '50833', '+53605', '454458', 330, 940),

(92, '01', 'saint-maurice-de-gourdans', 'SAINT-MAURICE-DE-GOURDANS', 'saint maurice de gourdans', 'Saint-Maurice-de-Gourdans', 'S53562326352', 'SNTMRSTKRTNS', '01800', '378', '01378', 2, '19', 6, 2498, 1949, 2400, 98, 25.39, 5.2, 45.8167, '3176', '50913', '+51144', '454917', 182, 244),

(93, '01', 'chezery-forens', 'CHEZERY-FORENS', 'chezery forens', 'Chézery-Forens', 'C61652', 'XSRFRNS', '01200', '104', '01104', 3, '12', 6, 434, 367, 400, 9, 46.57, 5.88333, 46.2167, '3922', '51357', '+55159', '461318', 435, 1692),

(94, '01', 'sault-brenaz', 'SAULT-BRENAZ', 'sault brenaz', 'Sault-Brénaz', 'S431652', 'SLTBRNS', '01150', '396', '01396', 1, '17', 6, 1043, 974, 1100, 185, 5.61, 5.41667, 45.85, '3415', '50950', '+52436', '455119', 196, 660),

(95, '01', 'murs-et-gelignieux', 'MURS-ET-GELIGNIEUX', 'murs et gelignieux', 'Murs-et-Gélignieux', 'M62324252', 'MRSTJLKNKS', '01300', '268', '01268', 1, '04', 6, 241, 204, 200, 37, 6.46, 5.66667, 45.6333, '3695', '50713', '+53943', '453829', 210, 460),

(96, '01', 'petit-abergement', 'LE PETIT-ABERGEMENT', 'le petit abergement', 'Le Petit-Abergement', 'L1316253', 'LPTTBRJMNT', '01260', '292', '01292', 4, '06', 6, 138, 142, 100, 5, 26.95, 5.65, 46.0333, '3697', '51147', '+53949', '460157', 706, 1177),

(97, '01', 'cormoz', 'CORMOZ', 'cormoz', 'Cormoz', 'C652', 'KRMS', '01560', '124', '01124', 2, '29', 6, 625, 512, 500, 31, 19.56, 5.23333, 46.45, '3217', '51610', '+51356', '462657', 187, 223),

(98, '01', 'saint-martin-de-bavel', 'SAINT-MARTIN-DE-BAVEL', 'saint martin de bavel', 'Saint-Martin-de-Bavel', 'S535635314', 'SNTMRTNTBFL', '01510', '372', '01372', 1, '36', 6, 443, 333, 500, 52, 8.5, 5.68333, 45.85, '3712', '50944', '+54039', '455057', 249, 442),

(99, '01', 'saint-trivier-de-courtes', 'SAINT-TRIVIER-DE-COURTES', 'saint trivier de courtes', 'Saint-Trivier-de-Courtes', 'S5361632632', 'SNTTRFRTKRTS', '01560', '388', '01388', 2, '29', 5, 1013, 963, 1000, 61, 16.53, 5.08333, 46.4667, '3050', '51622', '+50453', '462735', 184, 218),

(100, '01', 'boyeux-saint-jerome', 'BOYEUX-SAINT-JEROME', 'boyeux saint jerome', 'Boyeux-Saint-Jérôme', 'B253265', 'BYKSSNTJRM', '01640', '056', '01056', 4, '24', 6, 321, 277, 300, 18, 16.94, 5.46667, 46.0333, '3467', '51144', '+52724', '460148', 329, 900),

(101, '01', 'chateau-gaillard', 'CHATEAU-GAILLARD', 'chateau gaillard', 'Château-Gaillard', 'C32463', 'XTKLRT', '01500', '089', '01089', 1, '01', 6, 1818, 1370, 1700, 113, 16.06, 5.3, 45.9667, '3297', '51082', '+51815', '455824', 222, 253),

(102, '01', 'premeyzel', 'PREMEYZEL', 'premeyzel', 'Prémeyzel', 'P6524', 'PRMSL', '01300', '310', '01310', 1, '04', 6, 234, 242, 300, 30, 7.63, 5.65, 45.6833, '3679', '50760', '+53853', '454102', 290, 750),

(103, '01', 'arandas', 'ARANDAS', 'arandas', 'Arandas', 'A6532', 'ARNTS', '01230', '013', '01013', 1, '28', 6, 163, 135, 200, 11, 14.1, 5.48333, 45.9, '3500', '50995', '+52911', '455342', 455, 939),

(104, '01', 'chatenay-01', 'CHATENAY', 'chatenay', 'Châtenay', 'C350', 'XTN', '01320', '090', '01090', 2, '08', 6, 352, 308, 300, 23, 14.95, 5.2, 46.0333, '3183', '51148', '+51206', '460200', 272, 317),

(105, '01', 'innimond', 'INNIMOND', 'innimond', 'Innimond', 'I530', 'INMNT', '01680', '190', '01190', 1, '18', 6, 114, 95, 100, 8, 13.44, 5.56667, 45.7833, '3595', '50870', '+53421', '454658', 811, 1218),

(106, '01', 'boz', 'BOZ', 'boz', 'Boz', 'B200', 'BS', '01190', '057', '01057', 2, '26', 6, 496, 360, 500, 67, 7.31, 4.9, 46.4, '2859', '51563', '+45434', '462425', 168, 206),

(107, '01', 'briord', 'BRIORD', 'briord', 'Briord', 'B630', 'BRRT', '01470', '064', '01064', 1, '18', 6, 893, 674, 900, 72, 12.29, 5.46667, 45.7833, '3470', '50869', '+52734', '454657', 200, 580),

(108, '01', 'reyrieux', 'REYRIEUX', 'reyrieux', 'Reyrieux', 'R200', 'RRKS', '01600', '322', '01322', 2, '42', 5, 4093, 3690, 4000, 260, 15.7, 4.81667, 45.9333, '2763', '51038', '+44924', '455604', 163, 297),

(109, '01', 'matafelon-granges', 'MATAFELON-GRANGES', 'matafelon granges', 'Matafelon-Granges', 'M31452652', 'MTFLNKRNJS', '01580', '240', '01240', 4, '16', 6, 652, 484, 700, 30, 21.54, 5.56667, 46.2667, '3575', '51401', '+53314', '461540', 267, 783),

(110, '01', 'drom', 'DROM', 'drom', 'Drom', 'D650', 'TRM', '01250', '150', '01150', 2, '07', 6, 209, 160, 200, 26, 7.78, 5.36667, 46.2167, '3369', '51353', '+52207', '461303', 310, 505),

(111, '01', 'chatillon-en-michaille', 'CHATILLON-EN-MICHAILLE', 'chatillon en michaille', 'Châtillon-en-Michaille', 'C34524', 'XTLNNMXL', '01200', '091', '01091', 4, '03', 6, 3120, 2657, 3100, 82, 37.62, 5.78333, 46.1333, '3848', '51272', '+54760', '460840', 373, 1241),

(112, '01', 'polliat', 'POLLIAT', 'polliat', 'Polliat', 'P430', 'PLT', '01310', '301', '01301', 2, '43', 6, 2403, 2019, 2400, 119, 20.07, 5.13333, 46.25, '3099', '51388', '+50733', '461456', 198, 233),

(113, '01', 'vesancy', 'VESANCY', 'vesancy', 'Vesancy', 'V252', 'FSNS', '01170', '436', '01436', 3, '14', 6, 526, 449, 500, 49, 10.7, 6.08333, 46.35, '4171', '51498', '+60527', '462055', 582, 1490),

(114, '01', 'massieux', 'MASSIEUX', 'massieux', 'Massieux', 'M200', 'MSKS', '01600', '238', '01238', 2, '42', 6, 2428, 2119, 2400, 783, 3.1, 4.83333, 45.9167, '2771', '51010', '+44949', '455431', 168, 284),

(115, '01', 'saint-cyr-sur-menthon', 'SAINT-CYR-SUR-MENTHON', 'saint cyr sur menthon', 'Saint-Cyr-sur-Menthon', 'S532626535', 'SNTSRSRMN0N', '01380', '343', '01343', 2, '27', 6, 1636, 1313, 1600, 96, 16.93, 4.98333, 46.2667, '2929', '51417', '+45823', '461632', 181, 217),

(116, '01', 'serrieres-sur-ain', 'SERRIERES-SUR-AIN', 'serrieres sur ain', 'Serrières-sur-Ain', 'S6265', 'SRRSSRN', '01450', '404', '01404', 4, '16', 6, 119, 79, 100, 14, 8.18, 5.45, 46.15, '3461', '51281', '+52704', '460910', 260, 649),

(117, '01', 'nivollet-montgriffon', 'NIVOLLET-MONTGRIFFON', 'nivollet montgriffon', 'Nivollet-Montgriffon', 'N143532615', 'NFLTMNTKRFN', '01230', '277', '01277', 1, '28', 6, 143, 91, 100, 17, 8.24, 5.43333, 45.9833, '3482', '51115', '+52815', '460011', 440, 833),

(118, '01', 'izernore', 'IZERNORE', 'izernore', 'Izernore', 'I2656', 'ISRNR', '01580', '192', '01192', 4, '16', 5, 2278, 1652, 2200, 109, 20.86, 5.55, 46.2167, '3575', '51356', '+53314', '461314', 377, 822),

(119, '01', 'saint-nizier-le-desert', 'SAINT-NIZIER-LE-DESERT', 'saint nizier le desert', 'Saint-Nizier-le-Désert', 'S5352643263', 'SNTNSRLTSRT', '01320', '381', '01381', 2, '08', 6, 880, 489, 900, 35, 24.96, 5.15, 46.05, '3124', '51173', '+50854', '460321', 268, 323),

(120, '01', 'guereins', 'GUEREINS', 'guereins', 'Guéreins', 'G652', 'KRNS', '01090', '183', '01183', 2, '32', 6, 1308, 1065, 1200, 290, 4.51, 4.78333, 46.1, '2715', '51231', '+44647', '460629', 169, 232),

(121, '01', 'illiat', 'ILLIAT', 'illiat', 'Illiat', 'I430', 'ILT', '01140', '188', '01188', 2, '32', 6, 570, 464, 500, 27, 20.37, 4.88333, 46.1833, '2835', '51323', '+45318', '461125', 190, 257),

(122, '01', 'trancliere', 'LA TRANCLIERE', 'la trancliere', 'La Tranclière', 'L365246', 'LTRNKLR', '01160', '425', '01425', 2, '25', 6, 301, 300, 300, 20, 14.75, 5.26667, 46.1167, '3250', '51235', '+51542', '460640', 248, 302),

(123, '01', 'saint-didier-de-formans', 'SAINT-DIDIER-DE-FORMANS', 'saint didier de formans', 'Saint-Didier-de-Formans', 'S53631652', 'SNTTTRTFRMNS', '01600', '347', '01347', 2, '34', 6, 1792, 1545, 1800, 274, 6.53, 4.78333, 45.95, '2715', '51063', '+44649', '455723', 179, 258),

(124, '01', 'merignat', 'MERIGNAT', 'merignat', 'Mérignat', 'M6253', 'MRKNT', '01450', '242', '01242', 4, '24', 6, 139, 114, 100, 43, 3.17, 5.43333, 46.0667, '3444', '51188', '+52612', '460410', 300, 587),

(125, '01', 'saint-eloi-01', 'SAINT-ELOI', 'saint eloi', 'Saint-Éloi', 'S534', 'SNTL', '01800', '349', '01349', 2, '19', 6, 399, 403, 400, 27, 14.26, 5.15, 45.9333, '3129', '51037', '+50908', '455559', 234, 310),

(126, '01', 'chapelle-du-chatelard', 'LA CHAPELLE-DU-CHATELARD', 'la chapelle du chatelard', 'La Chapelle-du-Châtelard', 'L214323463', 'LXPLTXTLRT', '01240', '085', '01085', 2, '35', 6, 341, 263, 300, 25, 13.37, 5.03333, 46.0667, '2988', '51188', '+50132', '460408', 236, 285),

(127, '01', 'saint-jean-de-niost', 'SAINT-JEAN-DE-NIOST', 'saint jean de niost', 'Saint-Jean-de-Niost', 'S53253523', 'SNTJNTNST', '01800', '361', '01361', 2, '19', 6, 1421, 1082, 1400, 100, 14.19, 5.21667, 45.8333, '3202', '50933', '+51307', '455024', 193, 242),

(128, '01', 'savigneux-01', 'SAVIGNEUX', 'savigneux', 'Savigneux', 'S1252', 'SFKNKS', '01480', '398', '01398', 2, '30', 6, 1204, 876, 1200, 81, 14.75, 4.85, 46, '2790', '51112', '+45052', '460004', 237, 287),

(129, '01', 'nattages', 'NATTAGES', 'nattages', 'Nattages', 'N320', 'NTJS', '01300', '271', '01271', 1, '04', 6, 564, 393, 500, 54, 10.33, 5.76667, 45.7333, '3808', '50811', '+54550', '454347', 220, 633),

(130, '01', 'saint-benoît-01', 'SAINT-BENOIT', 'saint benoit', 'Saint-Benoît', 'S53153', 'SNTBNT', '01300', '338', '01338', 1, '18', 6, 773, 582, 700, 35, 21.65, 5.58333, 45.7, '3613', '50772', '+53519', '454140', 201, 778),

(131, '01', 'douvres', 'DOUVRES', 'douvres', 'Douvres', 'D162', 'TFRS', '01500', '149', '01149', 1, '01', 6, 962, 646, 900, 182, 5.26, 5.36667, 45.9833, '3374', '51099', '+52223', '455920', 249, 480),

(132, '01', 'francheleins', 'FRANCHELEINS', 'francheleins', 'Francheleins', 'F652452', 'FRNXLNS', '01090', '165', '01165', 2, '30', 6, 1323, 994, 1200, 97, 13.56, 4.8, 46.0667, '2747', '51193', '+44831', '460425', 174, 273),

(133, '01', 'dortan', 'DORTAN', 'dortan', 'Dortan', 'D635', 'TRTN', '01590', '148', '01148', 4, '23', 6, 1996, 2188, 2100, 110, 18.11, 5.66667, 46.3167, '3692', '51465', '+53933', '461908', 300, 758),

(134, '01', 'saint-germain-les-paroisses', 'SAINT-GERMAIN-LES-PAROISSES', 'saint germain les paroisses', 'Saint-Germain-les-Paroisses', 'S5326542162', 'SNTJRMNLSPRSS', '01300', '358', '01358', 1, '04', 6, 387, 307, 400, 23, 16.27, 5.61667, 45.7667, '3646', '50860', '+53705', '454625', 295, 1000),

(135, '01', 'miribel-01', 'MIRIBEL', 'miribel', 'Miribel', 'M614', 'MRBL', '01700', '249', '01249', 2, '40', 5, 9066, 8545, 9000, 370, 24.49, 4.95306, 45.8245, '2907', '50916', '+45711', '454928', 168, 314),

(136, '01', 'lancrans', 'LANCRANS', 'lancrans', 'Lancrans', 'L52652', 'LNKRNS', '01200', '205', '01205', 3, '12', 6, 1052, 934, 1000, 108, 9.66, 5.83333, 46.1333, '3885', '51249', '+55000', '460728', 350, 1606),

(137, '01', 'echenevex', 'ECHENEVEX', 'echenevex', 'Échenevex', 'E2512', 'EXNFKS', '01170', '153', '01153', 3, '14', 6, 1631, 1203, 1500, 99, 16.44, 6.03333, 46.3167, '4110', '51454', '+60210', '461832', 490, 1682),

(138, '01', 'saint-jean-sur-veyle', 'SAINT-JEAN-SUR-VEYLE', 'saint jean sur veyle', 'Saint-Jean-sur-Veyle', 'S53252614', 'SNTJNSRFL', '01290', '365', '01365', 2, '27', 6, 1082, 958, 1100, 96, 11.21, 4.91667, 46.25, '2866', '51398', '+45456', '461529', 176, 213),

(139, '01', 'billiat', 'BILLIAT', 'billiat', 'Billiat', 'B430', 'BLT', '01200', '044', '01044', 4, '03', 6, 484, 411, 400, 35, 13.7, 5.78333, 46.0667, '3832', '51197', '+54707', '460437', 324, 1314),

(140, '01', 'abergement-de-varey', 'L''ABERGEMENT-DE-VAREY', 'l abergement de varey', 'L''Abergement-de-Varey', 'L1625316', 'LBRJMNTTFR', '01640', '002', '01002', 1, '01', 6, 221, 167, 200, 24, 9.15, 5.41667, 46, '3431', '51119', '+52528', '460025', 290, 748),

(141, '01', 'villeneuve-01', 'VILLENEUVE', 'villeneuve', 'Villeneuve', 'V451', 'FLNF', '01480', '446', '01446', 2, '30', 6, 1383, 939, 1400, 51, 26.79, 4.83667, 46.0212, '2778', '51134', '+45012', '460116', 230, 287),

(142, '01', 'villars-les-dombes', 'VILLARS-LES-DOMBES', 'villars les dombes', 'Villars-les-Dombes', 'V462423512', 'FLRSLSTMS', '01330', '443', '01443', 2, '35', 5, 4399, 4197, 4300, 178, 24.65, 5.01667, 46, '2992', '51114', '+50147', '460009', 263, 295),

(143, '01', 'thezillieu', 'THEZILLIEU', 'thezillieu', 'Thézillieu', 'T240', '0SL', '01110', '417', '01417', 1, '15', 6, 324, 300, 300, 12, 26.25, 5.6, 45.8833, '3627', '50992', '+53603', '455334', 706, 1123),

(144, '01', 'saint-etienne-sur-reyssouze', 'SAINT-ETIENNE-SUR-REYSSOUZE', 'saint etienne sur reyssouze', 'Saint-Étienne-sur-Reyssouze', 'S535262', 'SNTTNSRRSS', '01190', '352', '01352', 2, '26', 6, 531, 387, 500, 38, 13.82, 5, 46.4, '2960', '51570', '+50003', '462447', 175, 209),

(145, '01', 'souclin', 'SOUCLIN', 'souclin', 'Souclin', 'S450', 'SKLN', '01150', '411', '01411', 1, '17', 6, 261, 221, 300, 19, 13.19, 5.41667, 45.8667, '3424', '50974', '+52506', '455234', 420, 1064),

(146, '01', 'saint-just-01', 'SAINT-JUST', 'saint just', 'Saint-Just', 'S5323', 'SNTJST', '01250', '369', '01369', 2, '39', 6, 881, 788, 900, 260, 3.38, 5.28, 46.1903, '3270', '51323', '+51648', '461125', 235, 268),

(147, '01', 'civrieux', 'CIVRIEUX', 'civrieux', 'Civrieux', 'C162', 'SFRKS', '01390', '105', '01105', 2, '42', 6, 1362, 1079, 1300, 68, 19.76, 4.88333, 45.9167, '2827', '51023', '+45251', '455516', 225, 311),

(148, '01', 'argis', 'ARGIS', 'argis', 'Argis', 'A620', 'ARJS', '01230', '017', '01017', 1, '28', 6, 421, 389, 400, 53, 7.84, 5.48333, 45.9333, '3505', '51038', '+52928', '455602', 300, 819),

(149, '01', 'talissieu', 'TALISSIEU', 'talissieu', 'Talissieu', 'T420', 'TLS', '01510', '415', '01415', 1, '09', 6, 425, 405, 500, 88, 4.8, 5.71667, 45.8667, '3765', '50962', '+54330', '455157', 232, 574),

(150, '01', 'birieux', 'BIRIEUX', 'birieux', 'Birieux', 'B620', 'BRKS', '01330', '045', '01045', 2, '35', 6, 236, 145, 200, 14, 15.83, 5.03333, 45.95, '3004', '51059', '+50225', '455710', 277, 291),

(151, '01', 'saint-julien-sur-veyle', 'SAINT-JULIEN-SUR-VEYLE', 'saint julien sur veyle', 'Saint-Julien-sur-Veyle', 'S532452614', 'SNTJLNSRFL', '01540', '368', '01368', 2, '10', 6, 715, 523, 700, 72, 9.84, 4.95, 46.2, '2908', '51336', '+45715', '461208', 184, 252),

(152, '01', 'thoiry-01', 'THOIRY', 'thoiry', 'Thoiry', 'T600', '0R', '01710', '419', '01419', 3, '13', 6, 5205, 4068, 4900, 179, 28.93, 5.97973, 46.2364, '4048', '51374', '+55847', '461411', 400, 1704),

(153, '01', 'laiz', 'LAIZ', 'laiz', 'Laiz', 'L200', 'LS', '01290', '203', '01203', 2, '27', 6, 1130, 990, 1100, 109, 10.31, 4.88333, 46.25, '2836', '51387', '+45320', '461454', 173, 210),

(154, '01', 'cressin-rochefort', 'CRESSIN-ROCHEFORT', 'cressin rochefort', 'Cressin-Rochefort', 'C62562163', 'KRSNRXFRT', '01350', '133', '01133', 1, '04', 6, 374, 308, 400, 47, 7.93, 5.76667, 45.7667, '3805', '50863', '+54540', '454636', 225, 554),

(155, '01', 'saint-champ', 'SAINT-CHAMP', 'saint champ', 'Saint-Champ', 'S53251', 'SNTXMP', '01300', '341', '01341', 1, '04', 6, 139, 132, 100, 27, 5.14, 5.73333, 45.7833, '3771', '50871', '+54351', '454702', 286, 554),

(156, '01', 'saint-georges-sur-renon', 'SAINT-GEORGES-SUR-RENON', 'saint georges sur renon', 'Saint-Georges-sur-Renon', 'S5326265', 'SNTJRJSSRRNN', '01400', '356', '01356', 2, '10', 6, 197, 162, 200, 34, 5.66, 5.03333, 46.1, '2995', '51228', '+50155', '460620', 240, 291),

(157, '01', 'lantenay-01', 'LANTENAY', 'lantenay', 'Lantenay', 'L535', 'LNTN', '01430', '206', '01206', 4, '06', 6, 257, 257, 300, 38, 6.59, 5.53333, 46.05, '3561', '51175', '+53230', '460327', 650, 1012),

(158, '01', 'vernoux', 'VERNOUX', 'vernoux', 'Vernoux', 'V652', 'FRNKS', '01560', '433', '01433', 2, '29', 6, 285, 127, 200, 27, 10.2, 5.11667, 46.4833, '3082', '51646', '+50637', '462852', 187, 216),

(159, '01', 'cormaranche-en-bugey', 'CORMARANCHE-EN-BUGEY', 'cormaranche en bugey', 'Cormaranche-en-Bugey', 'C65652512', 'KRMRNXNBJ', '01110', '122', '01122', 1, '15', 6, 859, 726, 900, 45, 18.92, 5.6, 45.95, '3638', '51059', '+53640', '455711', 766, 1241),

(160, '01', 'sainte-euphemie', 'SAINTE-EUPHEMIE', 'sainte euphemie', 'Sainte-Euphémie', 'S5315', 'SNTFM', '01600', '353', '01353', 2, '42', 6, 1482, 1133, 1400, 321, 4.61, 4.78333, 45.9667, '2735', '51081', '+44753', '455822', 195, 261),

(161, '01', 'beaupont', 'BEAUPONT', 'beaupont', 'Beaupont', 'B530', 'BPNT', '01270', '029', '01029', 2, '11', 6, 624, 492, 600, 44, 14.07, 5.26667, 46.4, '3256', '51568', '+51601', '462441', 187, 228),

(162, '01', 'brens-01', 'BRENS', 'brens', 'Brens', 'B652', 'BRNS', '01300', '061', '01061', 1, '04', 6, 1158, 732, 1000, 167, 6.9, 5.69473, 45.7187, '3731', '50798', '+54141', '454307', 219, 347),

(163, '01', 'ramasse', 'RAMASSE', 'ramasse', 'Ramasse', 'R520', 'RMS', '01250', '317', '01317', 2, '07', 6, 250, 218, 300, 25, 9.86, 5.35, 46.2, '3354', '51328', '+52119', '461142', 310, 590),

(164, '01', 'divonne-les-bains', 'DIVONNE-LES-BAINS', 'divonne les bains', 'Divonne-les-Bains', 'D1542152', 'TFNLSBNS', '01220', '143', '01143', 3, '14', 6, 8160, 6158, 7800, 240, 33.88, 6.13333, 46.3667, '4229', '51508', '+60834', '462124', 464, 1447),

(165, '01', 'leaz', 'LEAZ', 'leaz', 'Léaz', 'L200', 'LS', '01200', '209', '01209', 3, '12', 6, 569, 482, 500, 49, 11.4, 5.88333, 46.1, '3944', '51220', '+55312', '460553', 330, 1507),

(166, '01', 'villes', 'VILLES', 'villes', 'Villes', 'V420', 'FLS', '01200', '448', '01448', 4, '03', 6, 385, 269, 400, 41, 9.21, 5.78333, 46.0833, '3831', '51209', '+54706', '460518', 392, 1321),

(167, '01', 'saint-julien-sur-reyssouze', 'SAINT-JULIEN-SUR-REYSSOUZE', 'saint julien sur reyssouze', 'Saint-Julien-sur-Reyssouze', 'S53245262', 'SNTJLNSRRSS', '01560', '367', '01367', 2, '29', 6, 668, 509, 600, 88, 7.52, 5.11667, 46.4, '3083', '51557', '+50641', '462406', 182, 218),

(168, '01', 'groslee', 'GROSLEE', 'groslee', 'Groslée', 'G624', 'KRSL', '01680', '182', '01182', 1, '18', 6, 353, 333, 400, 48, 7.27, 5.56667, 45.7167, '3589', '50792', '+53400', '454246', 202, 1000),

(169, '01', 'vandeins', 'VANDEINS', 'vandeins', 'Vandeins', 'V5352', 'FNTNS', '01660', '429', '01429', 2, '43', 6, 619, 510, 600, 65, 9.4, 5.08333, 46.2167, '3047', '51353', '+50445', '461303', 194, 251),

(170, '01', 'verjon', 'VERJON', 'verjon', 'Verjon', 'V625', 'FRJN', '01270', '432', '01432', 2, '11', 6, 250, 192, 300, 48, 5.11, 5.35, 46.35, '3350', '51495', '+52104', '462045', 210, 496),

(171, '01', 'saint-andre-sur-vieux-jonc', 'SAINT-ANDRE-SUR-VIEUX-JONC', 'saint andre sur vieux jonc', 'Saint-André-sur-Vieux-Jonc', 'S53536261252', 'SNTNTRSRFKSJNK', '01240', '336', '01336', 2, '39', 6, 1079, 965, 1000, 44, 24.22, 5.06667, 46.15, '3122', '51286', '+50847', '460926', 222, 269),

(172, '01', 'saint-andre-d-huiriat', 'SAINT-ANDRE-D''HUIRIAT', 'saint andre d huiriat', 'Saint-André-d''Huiriat', 'S53536363', 'SNTNTRTHRT', '01290', '334', '01334', 2, '27', 6, 543, 403, 500, 60, 9, 4.91667, 46.2167, '2862', '51348', '+45444', '461248', 186, 225),

(173, '01', 'grilly', 'GRILLY', 'grilly', 'Grilly', 'G640', 'KRL', '01220', '180', '01180', 3, '14', 6, 762, 615, 700, 101, 7.5, 6.11667, 46.3333, '4198', '51478', '+60654', '461950', 459, 751),

(174, '01', 'cessy', 'CESSY', 'cessy', 'Cessy', 'C000', 'SS', '01170', '071', '01071', 3, '14', 6, 3992, 2287, 3700, 624, 6.39, 6.06667, 46.3167, '4148', '51466', '+60412', '461909', 496, 583),

(175, '01', 'ordonnaz', 'ORDONNAZ', 'ordonnaz', 'Ordonnaz', 'O6352', 'ORTNS', '01510', '280', '01280', 1, '18', 6, 141, 117, 100, 9, 14.88, 5.53333, 45.8333, '3557', '50930', '+53218', '455014', 560, 1161),

(176, '01', 'vescours', 'VESCOURS', 'vescours', 'Vescours', 'V262', 'FSKRS', '01560', '437', '01437', 2, '29', 6, 208, 192, 200, 16, 12.48, 5.03333, 46.4667, '2987', '51639', '+50129', '462830', 184, 217),

(177, '01', 'meillonnas', 'MEILLONNAS', 'meillonnas', 'Meillonnas', 'M452', 'MLNS', '01370', '241', '01241', 2, '33', 6, 1298, 1205, 1300, 73, 17.74, 5.35, 46.25, '3350', '51383', '+52107', '461442', 232, 460),

(178, '01', 'geovreisset', 'GEOVREISSET', 'geovreisset', 'Géovreisset', 'G1623', 'JFRST', '01100', '171', '01171', 4, '41', 6, 903, 763, 900, 272, 3.31, 5.6, 46.25, '3646', '51396', '+53704', '461522', 567, 754),

(179, '01', 'ceyzerieu', 'CEYZERIEU', 'ceyzerieu', 'Ceyzérieu', 'C600', 'SSR', '01350', '073', '01073', 1, '36', 6, 929, 816, 900, 47, 19.72, 5.73333, 45.8333, '3766', '50928', '+54334', '455006', 226, 444),

(180, '01', 'beard-geovreissiat', 'BEARD-GEOVREISSIAT', 'beard geovreissiat', 'Béard-Géovreissiat', 'B6321623', 'BRTJFRST', '01460', '170', '01170', 4, '22', 6, 925, 712, 900, 197, 4.69, 5.56667, 46.2, '3578', '51322', '+53325', '461123', 446, 724),

(181, '01', 'burbanche', 'LA BURBANCHE', 'la burbanche', 'La Burbanche', 'L16152', 'LBRBNX', '01510', '066', '01066', 1, '36', 6, 72, 56, 100, 6, 10.82, 5.56667, 45.85, '3582', '50941', '+53338', '455048', 334, 860),

(182, '01', 'perrex', 'PERREX', 'perrex', 'Perrex', 'P620', 'PRKS', '01540', '291', '01291', 2, '27', 6, 826, 721, 800, 74, 11.07, 4.98333, 46.2333, '2935', '51384', '+45841', '461444', 179, 213),

(183, '01', 'villemotier', 'VILLEMOTIER', 'villemotier', 'Villemotier', 'V4536', 'FLMTR', '01270', '445', '01445', 2, '11', 6, 632, 455, 600, 45, 13.86, 5.31667, 46.35, '3316', '51496', '+51916', '462046', 197, 261),

(184, '01', 'jasseron', 'JASSERON', 'jasseron', 'Jasseron', 'J650', 'JSRN', '01250', '195', '01195', 2, '07', 6, 1552, 1257, 1400, 81, 18.93, 5.33333, 46.2167, '3320', '51347', '+51928', '461245', 246, 590),

(185, '01', 'corveissiat', 'CORVEISSIAT', 'corveissiat', 'Corveissiat', 'C6123', 'KRFST', '01250', '125', '01125', 2, '33', 6, 602, 473, 600, 26, 22.69, 5.48333, 46.2333, '3494', '51381', '+52853', '461435', 262, 668),

(186, '01', 'journans', 'JOURNANS', 'journans', 'Journans', 'J652', 'JRNNS', '01250', '197', '01197', 2, '25', 6, 324, 330, 300, 133, 2.43, 5.33333, 46.15, '3329', '51272', '+51957', '460841', 269, 506),

(187, '01', 'sermoyer', 'SERMOYER', 'sermoyer', 'Sermoyer', 'S656', 'SRMYR', '01190', '402', '01402', 2, '26', 6, 669, 543, 700, 40, 16.7, 4.98333, 46.5, '2938', '51666', '+45851', '462959', 168, 214),

(188, '01', 'charix', 'CHARIX', 'charix', 'Charix', 'C620', 'XRKS', '01130', '087', '01087', 4, '22', 6, 294, 265, 300, 16, 18.27, 5.68333, 46.1833, '3719', '51315', '+54103', '461060', 580, 1046),

(189, '01', 'arbignieu', 'ARBIGNIEU', 'arbignieu', 'Arbignieu', 'A6125', 'ARBKN', '01300', '015', '01015', 1, '04', 6, 480, 431, 500, 36, 13.07, 5.65, 45.7333, '3682', '50809', '+53902', '454342', 221, 495),

(190, '01', 'leyssard', 'LEYSSARD', 'leyssard', 'Leyssard', 'L263', 'LSRT', '01450', '214', '01214', 4, '16', 6, 153, 143, 200, 16, 9.13, 5.46667, 46.1667, '3488', '51284', '+52833', '460921', 280, 825),

(191, '01', 'saint-jean-de-thurigneux', 'SAINT-JEAN-DE-THURIGNEUX', 'saint jean de thurigneux', 'Saint-Jean-de-Thurigneux', 'S532536252', 'SNTJNT0RKNKS', '01390', '362', '01362', 2, '42', 6, 710, 554, 600, 44, 16, 4.88333, 45.95, '2829', '51058', '+45256', '455708', 265, 305),

(192, '01', 'frans', 'FRANS', 'frans', 'Frans', 'F652', 'FRNS', '01480', '166', '01166', 2, '34', 6, 1984, 1849, 2000, 248, 7.98, 4.78333, 45.9833, '2708', '51101', '+44626', '455929', 183, 267),

(193, '01', 'tenay', 'TENAY', 'tenay', 'Tenay', 'T500', 'TN', '01230', '416', '01416', 1, '28', 6, 1120, 1083, 1100, 85, 13.12, 5.5, 45.9167, '3524', '51022', '+53030', '455512', 320, 1020),

(194, '01', 'bage-la-ville', 'BAGE-LA-VILLE', 'bage la ville', 'Bâgé-la-Ville', 'B2414', 'BJLFL', '01380', '025', '01025', 2, '02', 6, 3040, 2318, 2900, 76, 39.68, 4.95, 46.3167, '2898', '51462', '+45643', '461856', 179, 217),

(195, '01', 'montmerle-sur-saone', 'MONTMERLE-SUR-SAONE', 'montmerle sur saone', 'Montmerle-sur-Saône', 'M35642625', 'MNTMRLSRSN', '01090', '263', '01263', 2, '32', 6, 3823, 2827, 3800, 918, 4.16, 4.76667, 46.0833, '2691', '51202', '+44531', '460453', 168, 227),

(196, '01', 'courmangoux', 'COURMANGOUX', 'courmangoux', 'Courmangoux', 'C652', 'KRMNKKS', '01370', '127', '01127', 2, '33', 6, 507, 360, 500, 34, 14.82, 5.36667, 46.3333, '3369', '51479', '+52208', '461952', 211, 652),

(197, '01', 'baneins', 'BANEINS', 'baneins', 'Baneins', 'B520', 'BNNS', '01990', '028', '01028', 2, '30', 6, 572, 528, 600, 64, 8.91, 4.9, 46.1167, '2850', '51233', '+45406', '460636', 207, 272),

(198, '01', 'lagnieu', 'LAGNIEU', 'lagnieu', 'Lagnieu', 'L250', 'LKN', '01150', '202', '01202', 1, '17', 5, 6756, 5882, 6700, 247, 27.25, 5.35, 45.9, '3347', '51004', '+52057', '455413', 192, 643),

(199, '01', 'attignat', 'ATTIGNAT', 'attignat', 'Attignat', 'A3253', 'ATKNT', '01340', '024', '01024', 2, '21', 6, 2936, 1923, 2700, 157, 18.69, 5.16667, 46.2833, '3137', '51430', '+50935', '461714', 199, 233),

(200, '01', 'saint-andre-de-bage', 'SAINT-ANDRE-DE-BAGE', 'saint andre de bage', 'Saint-André-de-Bâgé', 'S53536312', 'SNTNTRTBJ', '01380', '332', '01332', 2, '02', 6, 635, 507, 600, 235, 2.7, 4.91667, 46.3, '2874', '51446', '+45524', '461806', 183, 212),

(201, '01', 'pont-de-vaux', 'PONT-DE-VAUX', 'pont de vaux', 'Pont-de-Vaux', 'P5312', 'PNTTFKS', '01190', '305', '01305', 2, '26', 5, 2205, 2013, 2200, 292, 7.54, 4.93333, 46.4333, '2890', '51591', '+45617', '462555', 169, 204),

(202, '01', 'amberieu-en-bugey', 'AMBERIEU-EN-BUGEY', 'amberieu en bugey', 'Ambérieu-en-Bugey', 'A516512', 'AMRNBJ', '01500', '004', '01004', 1, '01', 5, 13835, 11432, 12800, 562, 24.6, 5.35, 45.95, '3357', '51065', '+52128', '455729', 237, 753),

(203, '01', 'peyzieux-sur-saone', 'PEYZIEUX-SUR-SAONE', 'peyzieux sur saone', 'Peyzieux-sur-Saône', 'P2625', 'PSKSSRSN', '01140', '295', '01295', 2, '32', 6, 473, 337, 400, 54, 8.66, 4.81667, 46.1167, '2754', '51252', '+44855', '460738', 169, 259),

(204, '01', 'crozet-01', 'CROZET', 'crozet', 'Crozet', 'C623', 'KRST', '01170', '135', '01135', 3, '14', 6, 1862, 1344, 1800, 67, 27.47, 6.01251, 46.2806, '4084', '51423', '+60045', '461650', 463, 1680),

(205, '01', 'seyssel-01', 'SEYSSEL', 'seyssel', 'Seyssel', 'S400', 'SSL', '01420', '407', '01407', 1, '31', 5, 942, 803, 900, 392, 2.4, 5.83194, 45.9597, '3883', '51065', '+54952', '455732', 250, 332),

(206, '01', 'beynost', 'BEYNOST', 'beynost', 'Beynost', 'B523', 'BNST', '01700', '043', '01043', 2, '40', 6, 4475, 3528, 4300, 420, 10.64, 5, 45.8333, '2961', '50934', '+50005', '455025', 174, 322),

(207, '01', 'versonnex-01', 'VERSONNEX', 'versonnex', 'Versonnex', 'V6252', 'FRSNKS', '01210', '435', '01435', 3, '13', 6, 2144, 1713, 2100, 364, 5.89, 6.09723, 46.3023, '4178', '51447', '+60550', '461808', 439, 506),

(208, '01', 'saint-laurent-sur-saone', 'SAINT-LAURENT-SUR-SAONE', 'saint laurent sur saone', 'Saint-Laurent-sur-Saône', 'S5346532625', 'SNTLRNTSRSN', '01620', '370', '01370', 2, '02', 6, 1749, 1657, 1700, 3300, 0.53, 4.83333, 46.3, '2781', '51450', '+45022', '461819', 167, 174),

(209, '01', 'artemare', 'ARTEMARE', 'artemare', 'Artemare', 'A6356', 'ARTMR', '01510', '022', '01022', 1, '09', 6, 1126, 970, 1100, 300, 3.75, 5.7, 45.8667, '3729', '50972', '+54134', '455228', 242, 360),

(210, '01', 'montracol', 'MONTRACOL', 'montracol', 'Montracol', 'M3624', 'MNTRKL', '01310', '264', '01264', 2, '39', 6, 967, 619, 900, 66, 14.56, 5.11667, 46.1833, '3095', '51330', '+50719', '461150', 211, 258),

(211, '01', 'parves', 'PARVES', 'parves', 'Parves', 'P612', 'PRFS', '01300', '286', '01286', 1, '04', 6, 360, 320, 300, 65, 5.53, 5.75, 45.75, '3783', '50827', '+54427', '454439', 240, 623),

(212, '01', 'pugieu', 'PUGIEU', 'pugieu', 'Pugieu', 'P200', 'PJ', '01510', '316', '01316', 1, '36', 6, 168, 125, 100, 34, 4.85, 5.65, 45.8167, '3680', '50912', '+53857', '454916', 238, 409),

(213, '01', 'virieu-le-grand', 'VIRIEU-LE-GRAND', 'virieu le grand', 'Virieu-le-Grand', 'V642653', 'FRLKRNT', '01510', '452', '01452', 1, '36', 5, 1156, 949, 1100, 92, 12.55, 5.65, 45.85, '3683', '50943', '+53906', '455057', 241, 1059),

(214, '01', 'saint-remy-01', 'SAINT-REMY', 'saint remy', 'Saint-Rémy', 'S5365', 'SNTRM', '01310', '385', '01385', 2, '39', 6, 906, 812, 800, 122, 7.38, 5.16667, 46.1833, '3146', '51321', '+51006', '461121', 216, 265),

(215, '01', 'rance', 'RANCE', 'rance', 'Rancé', 'R520', 'RNS', '01390', '318', '01318', 2, '42', 6, 641, 498, 600, 67, 9.53, 4.86667, 45.9667, '2813', '51073', '+45208', '455756', 244, 294),

(216, '01', 'grieges', 'GRIEGES', 'grieges', 'Grièges', 'G620', 'KRJS', '01290', '179', '01179', 2, '27', 6, 1899, 1599, 1800, 127, 14.87, 4.85, 46.25, '2793', '51394', '+45101', '461517', 169, 212),

(217, '01', 'grand-corent', 'GRAND-CORENT', 'grand corent', 'Grand-Corent', 'G6532653', 'KRNTKRNT', '01250', '177', '01177', 2, '07', 6, 161, 111, 100, 22, 7.13, 5.43333, 46.2, '3438', '51332', '+52551', '461157', 393, 668),

(218, '01', 'outriaz', 'OUTRIAZ', 'outriaz', 'Outriaz', 'O362', 'OTRS', '01430', '282', '01282', 4, '06', 6, 256, 267, 300, 43, 5.91, 5.55, 46.0667, '3567', '51186', '+53249', '460402', 647, 1103),

(219, '01', 'montagnieu-01', 'MONTAGNIEU', 'montagnieu', 'Montagnieu', 'M325', 'MNTKN', '01470', '255', '01255', 1, '18', 6, 495, 387, 500, 79, 6.22, 5.46667, 45.8, '3479', '50882', '+52803', '454738', 200, 714),

(220, '01', 'champagne-en-valromey', 'CHAMPAGNE-EN-VALROMEY', 'champagne en valromey', 'Champagne-en-Valromey', 'C51251465', 'XMPKNNFLRM', '01260', '079', '01079', 1, '09', 5, 765, 674, 700, 42, 18.16, 5.68333, 45.9, '3712', '51005', '+54039', '455416', 419, 746),

(221, '01', 'amberieux-en-dombes', 'AMBERIEUX-EN-DOMBES', 'amberieux en dombes', 'Ambérieux-en-Dombes', 'A516253512', 'AMRKSNTMS', '01330', '005', '01005', 2, '30', 6, 1616, 1407, 1600, 101, 15.92, 4.9, 46, '2851', '51109', '+45410', '455954', 265, 302),

(222, '01', 'boisse-01', 'LA BOISSE', 'la boisse', 'La Boisse', 'L120', 'LBS', '01120', '049', '01049', 2, '20', 6, 2928, 2704, 2900, 311, 9.4, 5.03333, 45.85, '2999', '50936', '+50208', '455032', 179, 319),

(223, '01', 'parcieux', 'PARCIEUX', 'parcieux', 'Parcieux', 'P620', 'PRSKS', '01600', '285', '01285', 2, '42', 6, 1095, 914, 1100, 348, 3.14, 4.81667, 45.9167, '2765', '51017', '+44931', '455456', 168, 287),

(224, '01', 'saint-didier-d-aussiat', 'SAINT-DIDIER-D''AUSSIAT', 'saint didier d aussiat', 'Saint-Didier-d''Aussiat', 'S536323', 'SNTTTRTST', '01340', '346', '01346', 2, '21', 6, 863, 667, 800, 56, 15.22, 5.06667, 46.3, '3027', '51451', '+50339', '461823', 194, 223),

(225, '01', 'saint-nizier-le-bouchoux', 'SAINT-NIZIER-LE-BOUCHOUX', 'saint nizier le bouchoux', 'Saint-Nizier-le-Bouchoux', 'S53526412', 'SNTNSRLBXKS', '01560', '380', '01380', 2, '29', 6, 703, 546, 700, 24, 28.3, 5.15, 46.45, '3127', '51622', '+50903', '462735', 192, 222);

INSERT INTO `villes_france_free` (`ville_id`, `ville_departement`, `ville_slug`, `ville_nom`, `ville_nom_simple`, `ville_nom_reel`, `ville_nom_soundex`, `ville_nom_metaphone`, `ville_code_postal`, `ville_commune`, `ville_code_commune`, `ville_arrondissement`, `ville_canton`, `ville_amdi`, `ville_population_2010`, `ville_population_1999`, `ville_population_2012`, `ville_densite_2010`, `ville_surface`, `ville_longitude_deg`, `ville_latitude_deg`, `ville_longitude_grd`, `ville_latitude_grd`, `ville_longitude_dms`, `ville_latitude_dms`, `ville_zmin`, `ville_zmax`) VALUES

(226, '01', 'ars-sur-formans', 'ARS-SUR-FORMANS', 'ars sur formans', 'Ars-sur-Formans', 'A6261652', 'ARSSRFRMNS', '01480', '021', '01021', 2, '42', 6, 1367, 1100, 1300, 248, 5.5, 4.81667, 45.9833, '2763', '51102', '+44922', '455931', 226, 281),

(227, '01', 'anglefort', 'ANGLEFORT', 'anglefort', 'Anglefort', 'A524163', 'ANKLFRT', '01350', '010', '01010', 1, '31', 6, 994, 772, 900, 33, 29.26, 5.80833, 45.9167, '3858', '51014', '+54832', '455444', 238, 1524),

(228, '01', 'corlier', 'CORLIER', 'corlier', 'Corlier', 'C646', 'KRLR', '01110', '121', '01121', 1, '15', 6, 124, 73, 100, 22, 5.45, 5.5, 46.0333, '3514', '51145', '+52957', '460149', 560, 917),

(229, '01', 'ferney-voltaire', 'FERNEY-VOLTAIRE', 'ferney voltaire', 'Ferney-Voltaire', 'F651436', 'FRNFLTR', '01210', '160', '01160', 3, '13', 5, 8025, 7071, 7800, 1678, 4.78, 6.11667, 46.25, '4190', '51395', '+60629', '461521', 409, 446),

(230, '01', 'saint-maurice-de-remens', 'SAINT-MAURICE-DE-REMENS', 'saint maurice de remens', 'Saint-Maurice-de-Rémens', 'S535623652', 'SNTMRSTRMNS', '01500', '379', '01379', 1, '01', 6, 709, 605, 700, 68, 10.35, 5.28333, 45.95, '3265', '51065', '+51632', '455731', 212, 235),

(231, '01', 'chatillon-la-palud', 'CHATILLON-LA-PALUD', 'chatillon la palud', 'Châtillon-la-Palud', 'C3454143', 'XTLNLPLT', '01320', '092', '01092', 2, '08', 6, 1562, 1075, 1500, 111, 14.01, 5.25, 45.9667, '3236', '51084', '+51456', '455833', 218, 326),

(232, '01', 'saint-sulpice-01', 'SAINT-SULPICE', 'saint sulpice', 'Saint-Sulpice', 'S532412', 'SNTSLPS', '01340', '387', '01387', 2, '21', 6, 142, 103, 100, 26, 5.26, 5.04167, 46.3203, '3006', '51467', '+50230', '461913', 193, 217),

(233, '01', 'saint-bois', 'SAINT-BOIS', 'saint bois', 'Saint-Bois', 'S5312', 'SNTBS', '01300', '340', '01340', 1, '04', 6, 123, 102, 100, 13, 9.42, 5.63333, 45.7, '3672', '50779', '+53828', '454203', 301, 778),

(234, '01', 'virignin', 'VIRIGNIN', 'virignin', 'Virignin', 'V625', 'FRKNN', '01300', '454', '01454', 1, '04', 6, 855, 642, 800, 108, 7.88, 5.71667, 45.7167, '3752', '50797', '+54247', '454302', 220, 605),

(235, '01', 'premillieu', 'PREMILLIEU', 'premillieu', 'Prémillieu', 'P654', 'PRML', '01110', '311', '01311', 1, '15', 6, 36, 33, 0, 4, 8.51, 5.56667, 45.8667, '3594', '50971', '+53417', '455227', 580, 1084),

(236, '01', 'genouilleux', 'GENOUILLEUX', 'genouilleux', 'Genouilleux', 'G542', 'JNLKS', '01090', '169', '01169', 2, '32', 6, 609, 400, 600, 149, 4.08, 4.78333, 46.1167, '2723', '51243', '+44713', '460708', 169, 231),

(237, '01', 'reyssouze', 'REYSSOUZE', 'reyssouze', 'Reyssouze', 'R200', 'RSS', '01190', '323', '01323', 2, '26', 6, 929, 714, 900, 97, 9.54, 4.91667, 46.4333, '2870', '51591', '+45509', '462555', 167, 202),

(238, '01', 'collonges', 'COLLONGES', 'collonges', 'Collonges', 'C452', 'KLNJS', '01550', '109', '01109', 3, '12', 5, 1897, 1105, 1600, 116, 16.25, 5.9, 46.1333, '3964', '51265', '+55415', '460819', 329, 1621),

(239, '01', 'saint-germain-de-joux', 'SAINT-GERMAIN-DE-JOUX', 'saint germain de joux', 'Saint-Germain-de-Joux', 'S5326532', 'SNTJRMNTJKS', '01130', '357', '01357', 4, '03', 6, 480, 476, 500, 42, 11.27, 5.73333, 46.1833, '3780', '51309', '+54418', '461040', 434, 1091),

(240, '01', 'bregnier-cordon', 'BREGNIER-CORDON', 'bregnier cordon', 'Brégnier-Cordon', 'B62562635', 'BRKNRKRTN', '01300', '058', '01058', 1, '04', 6, 832, 566, 700, 75, 11, 5.61667, 45.65, '3648', '50721', '+53711', '453856', 203, 460),

(241, '01', 'saint-martin-le-chatel', 'SAINT-MARTIN-LE-CHATEL', 'saint martin le chatel', 'Saint-Martin-le-Châtel', 'S5356354234', 'SNTMRTNLXTL', '01310', '375', '01375', 2, '21', 6, 790, 652, 800, 61, 12.77, 5.11667, 46.2833, '3088', '51424', '+50657', '461655', 197, 225),

(242, '01', 'marignieu', 'MARIGNIEU', 'marignieu', 'Marignieu', 'M625', 'MRKN', '01300', '234', '01234', 1, '36', 6, 148, 156, 200, 41, 3.55, 5.71667, 45.8, '3760', '50886', '+54316', '454749', 309, 503),

(243, '01', 'neyrolles', 'LES NEYROLLES', 'les neyrolles', 'Neyrolles', 'L25642', 'LSNRLS', '01130', '274', '01274', 4, '22', 6, 637, 617, 700, 67, 9.5, 5.63333, 46.1333, '3663', '51268', '+53801', '460830', 510, 1118),

(244, '01', 'sulignat', 'SULIGNAT', 'sulignat', 'Sulignat', 'S4253', 'SLKNT', '01400', '412', '01412', 2, '10', 6, 569, 485, 600, 52, 10.8, 4.96667, 46.1667, '2918', '51308', '+45747', '461038', 202, 278),

(245, '01', 'beny', 'BENY', 'beny', 'Bény', 'B500', 'BN', '01370', '038', '01038', 2, '11', 6, 724, 613, 700, 39, 18.25, 5.28333, 46.3333, '3274', '51466', '+51700', '461910', 200, 244),

(246, '01', 'injoux-genissiat', 'INJOUX-GENISSIAT', 'injoux genissiat', 'Injoux-Génissiat', 'I52523', 'INJKSJNST', '01200', '189', '01189', 4, '03', 6, 1055, 966, 1000, 35, 29.61, 5.78333, 46.05, '3851', '51168', '+54809', '460305', 266, 1342),

(247, '01', 'chanay', 'CHANAY', 'chanay', 'Chanay', 'C500', 'XN', '01420', '082', '01082', 1, '31', 6, 617, 573, 600, 34, 18.1, 5.78333, 46, '3832', '51118', '+54708', '460022', 260, 1184),

(248, '01', 'chatillon-sur-chalaronne', 'CHATILLON-SUR-CHALARONNE', 'chatillon sur chalaronne', 'Châtillon-sur-Chalaronne', 'C345262465', 'XTLNSRXLRN', '01400', '093', '01093', 2, '10', 5, 4922, 4130, 4900, 273, 17.98, 4.96667, 46.1167, '2911', '51244', '+45725', '460711', 215, 274),

(249, '01', 'farges-01', 'FARGES', 'farges', 'Farges', 'F620', 'FRJS', '01550', '158', '01158', 3, '12', 6, 854, 589, 800, 59, 14.28, 5.91667, 46.1667, '3965', '51298', '+55419', '461004', 360, 1527),

(250, '01', 'saint-alban-01', 'SAINT-ALBAN', 'saint alban', 'Saint-Alban', 'S53415', 'SNTLBN', '01450', '331', '01331', 4, '24', 6, 163, 133, 200, 20, 8.08, 5.45, 46.1, '3463', '51217', '+52712', '460544', 376, 634),

(251, '01', 'curtafond', 'CURTAFOND', 'curtafond', 'Curtafond', 'C63153', 'KRTFNT', '01310', '140', '01140', 2, '21', 6, 702, 589, 700, 56, 12.41, 5.08333, 46.2667, '3058', '51414', '+50519', '461621', 199, 227),

(252, '01', 'viriat', 'VIRIAT', 'viriat', 'Viriat', 'V630', 'FRT', '01440', '451', '01451', 2, '43', 5, 6006, 5287, 5700, 133, 45.03, 5.21667, 46.25, '3200', '51393', '+51260', '461513', 206, 257),

(253, '01', 'belleydoux', 'BELLEYDOUX', 'belleydoux', 'Belleydoux', 'B432', 'BLTKS', '01130', '035', '01035', 4, '23', 6, 321, 277, 300, 18, 17.63, 5.76667, 46.25, '3823', '51392', '+54639', '461509', 616, 1281),

(254, '01', 'bage-le-chatel', 'BAGE-LE-CHATEL', 'bage le chatel', 'Bâgé-le-Châtel', 'B24234', 'BJLXTL', '01380', '026', '01026', 2, '02', 5, 796, 759, 800, 904, 0.88, 4.93333, 46.3, '2881', '51453', '+45546', '461828', 184, 211),

(255, '01', 'sainte-olive', 'SAINTE-OLIVE', 'sainte olive', 'Sainte-Olive', 'S5341', 'SNTLF', '01330', '382', '01382', 2, '30', 6, 303, 254, 300, 41, 7.39, 4.93333, 46.0167, '2885', '51132', '+45601', '460107', 281, 301),

(256, '01', 'saint-genis-sur-menthon', 'SAINT-GENIS-SUR-MENTHON', 'saint genis sur menthon', 'Saint-Genis-sur-Menthon', 'S532526535', 'SNTJNSSRMN0N', '01380', '355', '01355', 2, '27', 6, 408, 363, 400, 35, 11.55, 5.01667, 46.2833, '2969', '51425', '+50032', '461656', 188, 218),

(257, '01', 'domsure', 'DOMSURE', 'domsure', 'Domsure', 'D526', 'TMSR', '01270', '147', '01147', 2, '11', 6, 473, 403, 500, 31, 15.2, 5.3, 46.4167, '3287', '51577', '+51742', '462509', 192, 233),

(258, '01', 'chavannes-sur-suran', 'CHAVANNES-SUR-SURAN', 'chavannes sur suran', 'Chavannes-sur-Suran', 'C1526265', 'XFNSSRSRN', '01250', '095', '01095', 2, '33', 6, 644, 485, 700, 29, 21.5, 5.41667, 46.2667, '3433', '51404', '+52536', '461548', 306, 770),

(259, '01', 'priay', 'PRIAY', 'priay', 'Priay', 'P600', 'PR', '01160', '314', '01314', 2, '25', 6, 1488, 1152, 1400, 94, 15.77, 5.28333, 46, '3282', '51115', '+51724', '460012', 222, 342),

(260, '01', 'peyrieu', 'PEYRIEU', 'peyrieu', 'Peyrieu', 'P600', 'PR', '01300', '294', '01294', 1, '04', 6, 821, 649, 800, 58, 14.13, 5.67751, 45.6767, '3712', '50752', '+54039', '454036', 210, 683),

(261, '01', 'lalleyriat', 'LALLEYRIAT', 'lalleyriat', 'Lalleyriat', 'L630', 'LLRT', '01130', '204', '01204', 4, '22', 6, 239, 195, 200, 15, 15.25, 5.71667, 46.15, '3754', '51283', '+54253', '460917', 497, 1241),

(262, '01', 'sergy-01', 'SERGY', 'sergy', 'Sergy', 'S620', 'SRJ', '01630', '401', '01401', 3, '13', 6, 1977, 1247, 1700, 208, 9.46, 6, 46.25, '4070', '51392', '+60000', '461511', 429, 1702),

(263, '01', 'saint-martin-du-frene', 'SAINT-MARTIN-DU-FRENE', 'saint martin du frene', 'Saint-Martin-du-Frêne', 'S5356353165', 'SNTMRTNTFRN', '01430', '373', '01373', 4, '22', 6, 1077, 1050, 1100, 56, 19.14, 5.55, 46.1333, '3573', '51266', '+53309', '460820', 476, 1125),

(264, '01', 'saint-maurice-de-beynost', 'SAINT-MAURICE-DE-BEYNOST', 'saint maurice de beynost', 'Saint-Maurice-de-Beynost', 'S5356231523', 'SNTMRSTBNST', '01700', '376', '01376', 2, '40', 6, 3865, 4017, 3900, 552, 6.99, 4.96667, 45.8333, '2932', '50923', '+45831', '454949', 172, 315),

(265, '01', 'servas-01', 'SERVAS', 'servas', 'Servas', 'S612', 'SRFS', '01240', '405', '01405', 2, '39', 6, 1184, 915, 1200, 90, 13.05, 5.16667, 46.1333, '3143', '51259', '+50956', '460758', 234, 279),

(266, '01', 'cuzieu-01', 'CUZIEU', 'cuzieu', 'Cuzieu', 'C000', 'KS', '01300', '141', '01141', 1, '36', 6, 407, 304, 400, 83, 4.87, 5.67445, 45.8192, '3708', '50910', '+54028', '454909', 260, 449),

(267, '01', 'jayat', 'JAYAT', 'jayat', 'Jayat', 'J300', 'JYT', '01340', '196', '01196', 2, '21', 6, 1049, 774, 1000, 64, 16.3, 5.11667, 46.3667, '3093', '51523', '+50715', '462214', 183, 218),

(268, '01', 'lavours', 'LAVOURS', 'lavours', 'Lavours', 'L162', 'LFRS', '01350', '208', '01208', 1, '04', 6, 148, 117, 100, 23, 6.3, 5.76667, 45.8, '3817', '50899', '+54621', '454833', 224, 320),

(269, '01', 'chevroux', 'CHEVROUX', 'chevroux', 'Chevroux', 'C162', 'XFRKS', '01190', '102', '01102', 2, '26', 6, 933, 657, 900, 54, 17.2, 4.95, 46.3833, '2902', '51534', '+45655', '462250', 176, 208),

(270, '01', 'pollieu', 'POLLIEU', 'pollieu', 'Pollieu', 'P400', 'PL', '01350', '302', '01302', 1, '04', 6, 157, 122, 200, 42, 3.71, 5.75, 45.8, '3783', '50889', '+54430', '454759', 225, 480),

(271, '01', 'beligneux', 'BELIGNEUX', 'beligneux', 'Béligneux', 'B4252', 'BLKNKS', '01360', '032', '01032', 2, '20', 6, 2905, 2595, 2900, 218, 13.3, 5.11667, 45.8667, '3102', '50947', '+50744', '455108', 202, 283),

(272, '01', 'brenaz', 'BRENAZ', 'brenaz', 'Brénaz', 'B652', 'BRNS', '01260', '059', '01059', 1, '09', 6, 92, 105, 100, 9, 9.79, 5.71667, 45.95, '3762', '51054', '+54322', '455654', 580, 1425),

(273, '01', 'benonces', 'BENONCES', 'benonces', 'Bénonces', 'B520', 'BNNSS', '01470', '037', '01037', 1, '18', 6, 275, 241, 300, 17, 15.33, 5.48333, 45.8333, '3487', '50920', '+52831', '454940', 280, 1029),

(274, '01', 'saint-jean-le-vieux-01', 'SAINT-JEAN-LE-VIEUX', 'saint jean le vieux', 'Saint-Jean-le-Vieux', 'S5325412', 'SNTJNLFKS', '01640', '363', '01363', 4, '24', 6, 1609, 1449, 1600, 104, 15.33, 5.38917, 46.0284, '3392', '51143', '+52321', '460142', 236, 506),

(275, '01', 'beauregard-01', 'BEAUREGARD', 'beauregard', 'Beauregard', 'B6263', 'BRKRT', '01480', '030', '01030', 2, '34', 6, 870, 816, 900, 925, 0.94, 4.75139, 46.002, '2683', '51113', '+44505', '460007', 168, 240),

(276, '01', 'oyonnax', 'OYONNAX', 'oyonnax', 'Oyonnax', 'O520', 'OYNKS', '01100', '283', '01283', 4, '98', 5, 22650, 24188, 23100, 626, 36.18, 5.66667, 46.25, '3687', '51395', '+53918', '461520', 440, 1082),

(277, '01', 'mionnay', 'MIONNAY', 'mionnay', 'Mionnay', 'M000', 'MN', '01390', '248', '01248', 2, '42', 6, 2077, 2111, 2100, 105, 19.62, 4.93333, 45.9, '2881', '50994', '+45547', '455342', 267, 321),

(278, '01', 'germagnat', 'GERMAGNAT', 'germagnat', 'Germagnat', 'G65253', 'JRMKNT', '01250', '172', '01172', 2, '33', 6, 145, 92, 100, 15, 9.48, 5.45, 46.3167, '3458', '51456', '+52655', '461839', 319, 761),

(279, '01', 'coligny', 'COLIGNY', 'coligny', 'Coligny', 'C425', 'KLKN', '01270', '108', '01108', 2, '11', 5, 1154, 1091, 1200, 68, 16.87, 5.35, 46.3833, '3344', '51537', '+52046', '462259', 199, 575),

(280, '01', 'simandre-sur-suran', 'SIMANDRE-SUR-SURAN', 'simandre sur suran', 'Simandre-sur-Suran', 'S53626265', 'SMNTRSRSRN', '01250', '408', '01408', 2, '07', 6, 650, 638, 700, 39, 16.3, 5.41667, 46.2167, '3423', '51361', '+52501', '461331', 296, 644),

(281, '01', 'abergement-clemenciat', 'L''ABERGEMENT-CLEMENCIAT', 'l abergement clemenciat', 'L''Abergement-Clémenciat', 'L1625324523', 'LBRJMNTKLMNXT', '01400', '001', '01001', 2, '10', 6, 784, 725, 800, 49, 15.95, 4.91667, 46.15, '2871', '51279', '+45516', '460904', 206, 272),

(282, '01', 'lescheroux', 'LESCHEROUX', 'lescheroux', 'Lescheroux', 'L262', 'LSXRKS', '01560', '212', '01212', 2, '29', 6, 683, 596, 700, 34, 20.05, 5.15, 46.4, '3122', '51563', '+50847', '462424', 182, 223),

(283, '01', 'ornex', 'ORNEX', 'ornex', 'Ornex', 'O652', 'ORNKS', '01210', '281', '01281', 3, '13', 6, 3531, 2666, 3200, 626, 5.64, 6.1, 46.2833, '4174', '51418', '+60536', '461634', 428, 487),

(284, '01', 'dommartin-01', 'DOMMARTIN', 'dommartin', 'Dommartin', 'D5635', 'TMRTN', '01380', '144', '01144', 2, '02', 6, 841, 597, 800, 48, 17.19, 4.99167, 46.3417, '2948', '51486', '+45924', '462015', 186, 217),

(285, '01', 'lompnas', 'LOMPNAS', 'lompnas', 'Lompnas', 'L5152', 'LMPNS', '01680', '219', '01219', 1, '18', 6, 149, 147, 200, 11, 12.69, 5.51667, 45.8, '3537', '50892', '+53113', '454811', 400, 980),

(286, '01', 'bettant', 'BETTANT', 'bettant', 'Bettant', 'B353', 'BTNT', '01500', '041', '01041', 1, '01', 6, 724, 685, 700, 214, 3.37, 5.36667, 45.9333, '3362', '51048', '+52146', '455637', 245, 605),

(287, '01', 'armix', 'ARMIX', 'armix', 'Armix', 'A652', 'ARMKS', '01510', '019', '01019', 1, '36', 6, 20, 15, 0, 2, 6.82, 5.58333, 45.85, '3610', '50944', '+53508', '455057', 420, 1064),

(288, '01', 'feillens', 'FEILLENS', 'feillens', 'Feillens', 'F452', 'FLNS', '01570', '159', '01159', 2, '02', 6, 3115, 2935, 3100, 208, 14.91, 4.88333, 46.3333, '2838', '51484', '+45328', '462009', 169, 207),

(289, '01', 'chavornay', 'CHAVORNAY', 'chavornay', 'Chavornay', 'C165', 'XFRN', '01510', '097', '01097', 1, '09', 6, 199, 176, 200, 25, 7.77, 5.7, 45.8833, '3759', '50977', '+54311', '455245', 305, 1440),

(290, '01', 'challex', 'CHALLEX', 'challex', 'Challex', 'C420', 'XLKS', '01630', '078', '01078', 3, '12', 6, 1225, 1060, 1100, 141, 8.67, 5.96667, 46.1833, '4044', '51313', '+55833', '461053', 330, 516),

(291, '01', 'vongnes', 'VONGNES', 'vongnes', 'Vongnes', 'V5252', 'FNKNS', '01350', '456', '01456', 1, '36', 6, 74, 89, 100, 36, 2.05, 5.71667, 45.8167, '3764', '50905', '+54327', '454853', 228, 505),

(292, '01', 'magnieu', 'MAGNIEU', 'magnieu', 'Magnieu', 'M250', 'MKN', '01300', '227', '01227', 1, '04', 6, 419, 292, 400, 67, 6.23, 5.71667, 45.7833, '3759', '50862', '+54310', '454632', 227, 460),

(293, '01', 'groissiat', 'GROISSIAT', 'groissiat', 'Groissiat', 'G623', 'KRST', '01810', '181', '01181', 4, '41', 6, 1143, 749, 1100, 180, 6.32, 5.6, 46.2167, '3640', '51366', '+53645', '461345', 507, 940),

(294, '01', 'dompierre-sur-chalaronne', 'DOMPIERRE-SUR-CHALARONNE', 'dompierre sur chalaronne', 'Dompierre-sur-Chalaronne', 'D516262465', 'TMPRSRXLRN', '01400', '146', '01146', 2, '10', 6, 389, 280, 400, 81, 4.78, 4.9, 46.1333, '2853', '51270', '+45416', '460836', 200, 262),

(295, '01', 'montluel', 'MONTLUEL', 'montluel', 'Montluel', 'M340', 'MNTLL', '01120', '262', '01262', 2, '20', 5, 6999, 6456, 6800, 174, 40.11, 5.05, 45.85, '3022', '50946', '+50323', '455106', 192, 312),

(296, '01', 'poizat', 'LE POIZAT', 'le poizat', 'Le Poizat', 'L123', 'LPST', '01130', '300', '01300', 4, '22', 6, 422, 321, 400, 23, 17.9, 5.7, 46.15, '3732', '51271', '+54144', '460839', 551, 1200),

(297, '01', 'hostiaz', 'HOSTIAZ', 'hostiaz', 'Hostiaz', 'H232', 'HSXS', '01110', '186', '01186', 1, '28', 6, 82, 62, 100, 7, 10.6, 5.53333, 45.9, '3553', '51002', '+53204', '455406', 680, 1086),

(298, '01', 'montanges', 'MONTANGES', 'montanges', 'Montanges', 'M352', 'MNTNJS', '01200', '257', '01257', 4, '03', 6, 330, 282, 300, 24, 13.7, 5.8, 46.1667, '3850', '51293', '+54805', '460951', 375, 1090),

(299, '01', 'sainte-julie', 'SAINTE-JULIE', 'sainte julie', 'Sainte-Julie', 'S5324', 'SNTJL', '01150', '366', '01366', 1, '17', 6, 889, 534, 800, 79, 11.15, 5.28333, 45.8833, '3269', '50989', '+51642', '455324', 209, 257),

(300, '01', 'bey-01', 'BEY', 'bey', 'Bey', 'B000', 'B', '01290', '042', '01042', 2, '27', 6, 245, 221, 200, 88, 2.77, 4.85, 46.2167, '2788', '51355', '+45045', '461310', 175, 213),

(301, '01', 'sonthonnax-la-montagne', 'SONTHONNAX-LA-MONTAGNE', 'sonthonnax la montagne', 'Sonthonnax-la-Montagne', 'S535245325', 'SN0NKSLMNTKN', '01580', '410', '01410', 4, '16', 6, 320, 303, 300, 22, 14.14, 5.53333, 46.2333, '3542', '51370', '+53127', '461359', 420, 783),

(302, '01', 'mezeriat', 'MEZERIAT', 'mezeriat', 'Mézériat', 'M263', 'MSRT', '01660', '246', '01246', 2, '10', 6, 2072, 1912, 2000, 108, 19.17, 5.03333, 46.2333, '3012', '51372', '+50250', '461405', 189, 223),

(303, '01', 'bellignat', 'BELLIGNAT', 'bellignat', 'Bellignat', 'B4253', 'BLKNT', '01810', '031', '01031', 4, '41', 6, 3537, 3505, 3500, 451, 7.83, 5.61667, 46.25, '3662', '51383', '+53758', '461441', 516, 983),

(304, '01', 'saint-marcel-01', 'SAINT-MARCEL', 'saint marcel', 'Saint-Marcel', 'S535624', 'SNTMRSL', '01390', '371', '01371', 2, '35', 6, 1212, 1058, 1200, 104, 11.64, 4.98723, 45.9487, '2945', '51054', '+45914', '455655', 278, 292),

(305, '01', 'belley', 'BELLEY', 'belley', 'Belley', 'B400', 'BL', '01300', '034', '01034', 1, '04', 4, 8755, 8002, 8800, 390, 22.42, 5.68333, 45.7667, '3724', '50844', '+54117', '454533', 220, 392),

(306, '01', 'corbonod', 'CORBONOD', 'corbonod', 'Corbonod', 'C6153', 'KRBNT', '01420', '118', '01118', 1, '31', 6, 1176, 898, 1200, 37, 31.59, 5.81667, 45.95, '3873', '51075', '+54920', '455802', 253, 1367),

(307, '01', 'neyron', 'NEYRON', 'neyron', 'Neyron', 'N650', 'NRN', '01700', '275', '01275', 2, '40', 6, 2472, 2155, 2300, 461, 5.36, 4.93223, 45.8148, '2884', '50905', '+45556', '454853', 165, 312),

(308, '01', 'saint-paul-de-varax', 'SAINT-PAUL-DE-VARAX', 'saint paul de varax', 'Saint-Paul-de-Varax', 'S53143162', 'SNTPLTFRKS', '01240', '383', '01383', 2, '35', 6, 1551, 1190, 1500, 59, 25.97, 5.13333, 46.1, '3102', '51221', '+50742', '460556', 245, 281),

(309, '01', 'pressiat', 'PRESSIAT', 'pressiat', 'Pressiat', 'P623', 'PRST', '01370', '312', '01312', 2, '33', 6, 224, 191, 200, 37, 6.01, 5.38333, 46.3333, '3388', '51470', '+52308', '461923', 235, 660),

(310, '01', 'chazey-bons', 'CHAZEY-BONS', 'chazey bons', 'Chazey-Bons', 'C152', 'XSBNS', '01300', '098', '01098', 1, '04', 6, 744, 665, 700, 70, 10.59, 5.68333, 45.8, '3717', '50892', '+54054', '454811', 223, 423),

(311, '01', 'servignat', 'SERVIGNAT', 'servignat', 'Servignat', 'S61253', 'SRFKNT', '01560', '406', '01406', 2, '29', 6, 160, 135, 200, 20, 7.99, 5.06667, 46.4333, '3036', '51593', '+50410', '462601', 178, 213),

(312, '01', 'marlieux', 'MARLIEUX', 'marlieux', 'Marlieux', 'M642', 'MRLKS', '01240', '235', '01235', 2, '35', 6, 887, 676, 800, 52, 16.85, 5.06667, 46.0667, '3040', '51183', '+50422', '460353', 263, 282),

(313, '01', 'andert-et-condon', 'ANDERT-ET-CONDON', 'andert et condon', 'Andert-et-Condon', 'A53632535', 'ANTRTTKNTN', '01300', '009', '01009', 1, '04', 6, 340, 275, 300, 48, 6.94, 5.65, 45.8, '3687', '50883', '+53919', '454741', 225, 374),

(314, '01', 'hautecourt-romaneche', 'HAUTECOURT-ROMANECHE', 'hautecourt romaneche', 'Hautecourt-Romanèche', 'H3263652', 'HTKRTRMNX', '01250', '184', '01184', 2, '07', 6, 773, 678, 700, 35, 21.6, 5.41667, 46.1583, '3423', '51289', '+52503', '460935', 260, 548),

(315, '01', 'crottet', 'CROTTET', 'crottet', 'Crottet', 'C630', 'KRTT', '01620', '134', '01134', 2, '27', 6, 1722, 1479, 1700, 142, 12.12, 4.9, 46.2833, '2839', '51419', '+45332', '461638', 170, 213),

(316, '01', 'druillat', 'DRUILLAT', 'druillat', 'Druillat', 'D643', 'TRLT', '01160', '151', '01151', 2, '25', 6, 1134, 879, 1100, 54, 20.72, 5.31667, 46.0667, '3312', '51178', '+51902', '460336', 232, 343),

(317, '01', 'dompierre-sur-veyle', 'DOMPIERRE-SUR-VEYLE', 'dompierre sur veyle', 'Dompierre-sur-Veyle', 'D5162614', 'TMPRSRFL', '01240', '145', '01145', 2, '25', 6, 1226, 968, 1200, 42, 29.1, 5.2, 46.0667, '3187', '51190', '+51217', '460416', 264, 312),

(318, '01', 'perouges', 'PEROUGES', 'perouges', 'Pérouges', 'P620', 'PRJS', '01800', '290', '01290', 2, '19', 6, 1204, 1102, 1200, 63, 18.97, 5.18333, 45.9, '3158', '51004', '+51046', '455412', 205, 303),

(319, '01', 'rignieux-le-franc', 'RIGNIEUX-LE-FRANC', 'rignieux le franc', 'Rignieux-le-Franc', 'R25241652', 'RKNKSLFRNK', '01800', '325', '01325', 2, '19', 6, 950, 839, 900, 63, 15.02, 5.18333, 45.9333, '3170', '51045', '+51122', '455624', 237, 316),

(320, '01', 'giron', 'GIRON', 'giron', 'Giron', 'G650', 'JRN', '01130', '174', '01174', 4, '03', 6, 162, 100, 100, 17, 9.39, 5.76667, 46.2333, '3819', '51362', '+54627', '461332', 779, 1206),

(321, '01', 'cerdon-01', 'CERDON', 'cerdon', 'Cerdon', 'C635', 'SRTN', '01450', '068', '01068', 4, '24', 6, 741, 672, 800, 60, 12.3, 5.46667, 46.0833, '3477', '51201', '+52757', '460450', 286, 992),

(322, '01', 'cruzilles-les-mepillat', 'CRUZILLES-LES-MEPILLAT', 'cruzilles les mepillat', 'Cruzilles-lès-Mépillat', 'C6242425143', 'KRSLSLSMPLT', '01290', '136', '01136', 2, '27', 6, 818, 651, 800, 69, 11.84, 4.88333, 46.2167, '2827', '51361', '+45250', '461329', 185, 222),

(323, '01', 'lelex', 'LELEX', 'lelex', 'Lélex', 'L200', 'LLKS', '01410', '210', '01210', 3, '14', 6, 225, 220, 200, 12, 17.63, 5.95, 46.3, '4006', '51448', '+55632', '461812', 720, 1703),

(324, '01', 'lhopital', 'LHOPITAL', 'lhopital', 'Lhôpital', 'L134', 'LHPTL', '01420', '215', '01215', 4, '03', 6, 59, 49, 100, 16, 3.68, 5.77834, 46.0217, '3824', '51135', '+54642', '460118', 395, 1160),

(325, '01', 'segny', 'SEGNY', 'segny', 'Ségny', 'S500', 'SKN', '01170', '399', '01399', 3, '14', 6, 1649, 1350, 1600, 508, 3.24, 6.08333, 46.3, '4152', '51441', '+60424', '461749', 467, 519),

(326, '01', 'cheignieu-la-balme', 'CHEIGNIEU-LA-BALME', 'cheignieu la balme', 'Cheignieu-la-Balme', 'C54145', 'XKNLBLM', '01510', '100', '01100', 1, '36', 6, 157, 112, 200, 25, 6.26, 5.61667, 45.8333, '3634', '50919', '+53628', '454938', 269, 1166),

(327, '01', 'saint-vulbas', 'SAINT-VULBAS', 'saint vulbas', 'Saint-Vulbas', 'S531412', 'SNTFLBS', '01150', '390', '01390', 1, '17', 6, 957, 803, 900, 44, 21.44, 5.28333, 45.8333, '3282', '50926', '+51727', '455002', 192, 227),

(328, '01', 'echallon', 'ECHALLON', 'echallon', 'Échallon', 'E245', 'EXLN', '01130', '152', '01152', 4, '23', 6, 772, 665, 800, 27, 28.09, 5.74139, 46.21, '3783', '51345', '+54429', '461236', 510, 1082),

(329, '01', 'montellier', 'LE MONTELLIER', 'le montellier', 'Le Montellier', 'L5346', 'LMNTLR', '01800', '260', '01260', 2, '19', 6, 244, 218, 200, 15, 15.38, 5.06667, 45.9333, '3041', '51034', '+50424', '455549', 267, 297),

(330, '01', 'martignat', 'MARTIGNAT', 'martignat', 'Martignat', 'M63253', 'MRTKNT', '01810', '237', '01237', 4, '41', 6, 1604, 1265, 1600, 121, 13.25, 5.6, 46.2167, '3636', '51344', '+53632', '461234', 490, 974),

(331, '01', 'ceyzeriat', 'CEYZERIAT', 'ceyzeriat', 'Ceyzériat', 'C630', 'SSRT', '01250', '072', '01072', 2, '07', 5, 2738, 2388, 2600, 292, 9.36, 5.31667, 46.1667, '3319', '51309', '+51926', '461042', 240, 585),

(332, '01', 'montcet', 'MONTCET', 'montcet', 'Montcet', 'M323', 'MNTST', '01310', '259', '01259', 2, '43', 6, 665, 489, 700, 99, 6.68, 5.11667, 46.2, '3084', '51347', '+50645', '461245', 200, 247),

(333, '01', 'vonnas', 'VONNAS', 'vonnas', 'Vonnas', 'V520', 'FNS', '01540', '457', '01457', 2, '10', 6, 2790, 2419, 2700, 156, 17.81, 5, 46.2167, '2949', '51355', '+45927', '461309', 183, 253),

(334, '01', 'buellas', 'BUELLAS', 'buellas', 'Buellas', 'B420', 'BLS', '01310', '065', '01065', 2, '43', 6, 1669, 1288, 1600, 163, 10.21, 5.13333, 46.2, '3108', '51344', '+50800', '461233', 205, 266),

(335, '01', 'saint-benigne', 'SAINT-BENIGNE', 'saint benigne', 'Saint-Bénigne', 'S531525', 'SNTBNKN', '01190', '337', '01337', 2, '26', 6, 1161, 817, 1100, 70, 16.49, 4.96667, 46.4333, '2916', '51605', '+45738', '462641', 168, 216),

(336, '01', 'chevillard', 'CHEVILLARD', 'chevillard', 'Chevillard', 'C1463', 'XFLRT', '01430', '101', '01101', 4, '06', 6, 162, 132, 200, 24, 6.67, 5.58333, 46.1167, '3606', '51233', '+53455', '460634', 660, 1108),

(337, '01', 'bouligneux', 'BOULIGNEUX', 'bouligneux', 'Bouligneux', 'B4252', 'BLKNKS', '01330', '052', '01052', 2, '35', 6, 309, 290, 300, 11, 26.09, 5, 46.0167, '2950', '51136', '+45930', '460122', 264, 301),

(338, '01', 'contrevoz', 'CONTREVOZ', 'contrevoz', 'Contrevoz', 'C53612', 'KNTRFS', '01300', '116', '01116', 1, '36', 6, 539, 430, 500, 38, 14.18, 5.63333, 45.8, '3658', '50896', '+53742', '454822', 266, 1218),

(339, '01', 'champdor', 'CHAMPDOR', 'champdor', 'Champdor', 'C5136', 'XMPTR', '01110', '080', '01080', 4, '06', 6, 464, 426, 500, 26, 17.37, 5.6, 46.0167, '3623', '51130', '+53550', '460102', 798, 1183),

(340, '01', 'port-01', 'PORT', 'port', 'Port', 'P630', 'PRT', '01460', '307', '01307', 4, '22', 6, 847, 913, 900, 199, 4.25, 5.56667, 46.1667, '3593', '51294', '+53413', '460952', 460, 991),

(341, '01', 'surjoux', 'SURJOUX', 'surjoux', 'Surjoux', 'S620', 'SRJKS', '01420', '413', '01413', 4, '03', 6, 78, 69, 100, 18, 4.31, 5.8, 46.0167, '3851', '51138', '+54810', '460127', 260, 510),

(342, '01', 'champfromier', 'CHAMPFROMIER', 'champfromier', 'Champfromier', 'C51656', 'XMPFRMR', '01410', '081', '01081', 4, '03', 6, 677, 591, 700, 20, 32.4, 5.81667, 46.2, '3867', '51327', '+54900', '461138', 480, 1540),

(343, '01', 'vesines', 'VESINES', 'vesines', 'Vésines', 'V252', 'FSNS', '01570', '439', '01439', 2, '02', 6, 91, 113, 100, 23, 3.88, 4.86667, 46.35, '2812', '51510', '+45202', '462133', 167, 176),

(344, '01', 'seillonnaz', 'SEILLONNAZ', 'seillonnaz', 'Seillonnaz', 'S452', 'SLNS', '01470', '400', '01400', 1, '18', 6, 138, 123, 100, 14, 9.59, 5.48333, 45.8, '3504', '50896', '+52925', '454824', 275, 724),

(345, '01', 'varambon', 'VARAMBON', 'varambon', 'Varambon', 'V6515', 'FRMN', '01160', '430', '01430', 2, '25', 6, 521, 386, 500, 65, 7.99, 5.31667, 46.0333, '3311', '51156', '+51859', '460225', 228, 347),

(346, '01', 'grand-abergement', 'LE GRAND-ABERGEMENT', 'le grand abergement', 'Le Grand-Abergement', 'L265316253', 'LKRNTBRJMNT', '01260', '176', '01176', 4, '06', 6, 109, 108, 100, 3, 31.92, 5.66667, 46.0333, '3709', '51149', '+54030', '460202', 696, 1293),

(347, '01', 'jassans-riottier', 'JASSANS-RIOTTIER', 'jassans riottier', 'Jassans-Riottier', 'J52636', 'JSNSRTR', '01480', '194', '01194', 2, '34', 6, 5976, 5333, 5900, 1242, 4.81, 4.75, 45.9833, '2689', '51095', '+44524', '455908', 167, 249),

(348, '01', 'asnieres-sur-saone', 'ASNIERES-SUR-SAONE', 'asnieres sur saone', 'Asnières-sur-Saône', 'A2562625', 'ASNRSSRSN', '01570', '023', '01023', 2, '02', 6, 73, 69, 100, 15, 4.68, 4.88333, 46.3833, '2829', '51538', '+45259', '462302', 167, 175),

(349, '01', 'condamine-01', 'CONDAMINE', 'condamine', 'Condamine', 'C535', 'KNTMN', '01430', '112', '01112', 4, '06', 6, 404, 285, 400, 87, 4.64, 5.56667, 46.1167, '3572', '51232', '+53304', '460632', 518, 808),

(350, '01', 'lhuis', 'LHUIS', 'lhuis', 'Lhuis', 'L200', 'LHS', '01680', '216', '01216', 1, '18', 5, 854, 721, 800, 34, 24.43, 5.53333, 45.75, '3552', '50830', '+53200', '454448', 201, 1020),

(351, '01', 'romans-01', 'ROMANS', 'romans', 'Romans', 'R520', 'RMNS', '01400', '328', '01328', 2, '10', 6, 587, 522, 600, 26, 22.32, 5.03333, 46.1167, '2985', '51243', '+50122', '460709', 227, 280),

(352, '01', 'pizay', 'PIZAY', 'pizay', 'Pizay', 'P200', 'PS', '01120', '297', '01297', 2, '20', 6, 777, 638, 800, 69, 11.18, 5.08333, 45.8833, '3059', '50987', '+50522', '455319', 217, 294),

(353, '01', 'certines', 'CERTINES', 'certines', 'Certines', 'C6352', 'SRTNS', '01240', '069', '01069', 2, '25', 6, 1445, 1287, 1500, 90, 15.92, 5.26667, 46.1333, '3253', '51258', '+51552', '460756', 243, 277),

(354, '01', 'ruffieu', 'RUFFIEU', 'ruffieu', 'Ruffieu', 'R100', 'RF', '01260', '330', '01330', 1, '09', 6, 202, 188, 200, 14, 14.03, 5.66667, 46, '3696', '51105', '+53948', '455939', 605, 1195),

(355, '01', 'meximieux', 'MEXIMIEUX', 'meximieux', 'Meximieux', 'M252', 'MKSMKS', '01800', '244', '01244', 2, '19', 5, 7268, 6835, 7300, 528, 13.75, 5.2, 45.9, '3175', '51005', '+51140', '455416', 206, 310),

(356, '01', 'saint-rambert-en-bugey', 'SAINT-RAMBERT-EN-BUGEY', 'saint rambert en bugey', 'Saint-Rambert-en-Bugey', 'S5365163512', 'SNTRMRTNBJ', '01230', '384', '01384', 1, '28', 5, 2164, 2067, 2200, 75, 28.55, 5.43333, 45.95, '3446', '51054', '+52617', '455655', 271, 819),

(357, '01', 'ambronay', 'AMBRONAY', 'ambronay', 'Ambronay', 'A5165', 'AMRN', '01500', '007', '01007', 1, '01', 6, 2362, 2144, 2300, 70, 33.55, 5.35, 46, '3360', '51117', '+52138', '460020', 225, 765),

(358, '01', 'cize-01', 'CIZE', 'cize', 'Cize', 'C000', 'SS', '01250', '106', '01106', 2, '07', 6, 170, 128, 200, 37, 4.52, 5.43333, 46.2, '3454', '51338', '+52644', '461215', 264, 540),

(359, '01', 'saint-germain-sur-renon', 'SAINT-GERMAIN-SUR-RENON', 'saint germain sur renon', 'Saint-Germain-sur-Renon', 'S53265265', 'SNTJRMNSRRNN', '01240', '359', '01359', 2, '35', 6, 236, 217, 200, 14, 15.8, 5.05, 46.0833, '3023', '51201', '+50327', '460450', 251, 286),

(360, '01', 'villette-sur-ain', 'VILLETTE-SUR-AIN', 'villette sur ain', 'Villette-sur-Ain', 'V43265', 'FLTSRN', '01320', '449', '01449', 2, '08', 6, 673, 472, 700, 34, 19.38, 5.26862, 45.9884, '3258', '51098', '+51607', '455918', 222, 331),

(361, '01', 'dagneux', 'DAGNEUX', 'dagneux', 'Dagneux', 'D252', 'TKNKS', '01120', '142', '01142', 2, '20', 6, 4099, 3760, 3900, 616, 6.65, 5.06667, 45.85, '3035', '50946', '+50405', '455106', 189, 285),

(362, '01', 'boissey-01', 'BOISSEY', 'boissey', 'Boissey', 'B200', 'BS', '01190', '050', '01050', 2, '26', 6, 288, 202, 200, 31, 9.05, 5, 46.3833, '2955', '51535', '+45946', '462254', 182, 208),

(363, '01', 'salavre', 'SALAVRE', 'salavre', 'Salavre', 'S416', 'SLFR', '01270', '391', '01391', 2, '11', 6, 284, 285, 300, 36, 7.77, 5.35, 46.3667, '3344', '51515', '+52046', '462150', 203, 561),

(364, '01', 'brion-01', 'BRION', 'brion', 'Brion', 'B650', 'BRN', '01460', '063', '01063', 4, '22', 6, 517, 559, 500, 115, 4.48, 5.55251, 46.1728, '3573', '51303', '+53309', '461022', 469, 642),

(365, '01', 'labalme', 'LABALME', 'labalme', 'Labalme', 'L145', 'LBLM', '01450', '200', '01200', 4, '24', 6, 204, 135, 200, 23, 8.8, 5.48333, 46.1, '3496', '51215', '+52859', '460535', 473, 999),

(366, '01', 'sauverny', 'SAUVERNY', 'sauverny', 'Sauverny', 'S165', 'SFRN', '01220', '397', '01397', 3, '13', 6, 1078, 1017, 1100, 570, 1.89, 6.11667, 46.3167, '4198', '51462', '+60653', '461855', 449, 516),

(367, '01', 'montceaux', 'MONTCEAUX', 'montceaux', 'Montceaux', 'M320', 'MNTSKS', '01090', '258', '01258', 2, '32', 6, 1164, 908, 1100, 116, 10.03, 4.8, 46.1, '2734', '51218', '+44750', '460547', 180, 244),

(368, '01', 'brenod', 'BRENOD', 'brenod', 'Brénod', 'B653', 'BRNT', '01110', '060', '01060', 4, '06', 5, 544, 427, 500, 22, 23.79, 5.6, 46.0667, '3633', '51179', '+53622', '460339', 831, 1136),

(369, '01', 'miserieux', 'MISERIEUX', 'miserieux', 'Misérieux', 'M262', 'MSRKS', '01600', '250', '01250', 2, '42', 6, 1762, 1432, 1700, 237, 7.41, 4.81667, 45.9833, '2749', '51082', '+44839', '455824', 211, 280),

(370, '01', 'prevessin-moens', 'PREVESSIN-MOENS', 'prevessin moens', 'Prévessin-Moëns', 'P61252', 'PRFSNMNS', '01280', '313', '01313', 3, '13', 6, 5980, 4263, 5300, 495, 12.07, 6.08333, 46.25, '4161', '51395', '+60455', '461520', 419, 486),

(371, '01', 'lent-01', 'LENT', 'lent', 'Lent', 'L530', 'LNT', '01240', '211', '01211', 2, '39', 6, 1328, 1148, 1300, 42, 31.48, 5.2, 46.1167, '3177', '51244', '+51145', '460710', 240, 296),

(372, '01', 'marsonnas', 'MARSONNAS', 'marsonnas', 'Marsonnas', 'M6252', 'MRSNS', '01340', '236', '01236', 2, '21', 6, 1005, 728, 900, 54, 18.38, 5.06667, 46.3333, '3038', '51490', '+50416', '462027', 189, 222),

(373, '01', 'manziat', 'MANZIAT', 'manziat', 'Manziat', 'M230', 'MNST', '01570', '231', '01231', 2, '02', 6, 1924, 1596, 1900, 152, 12.63, 4.9, 46.35, '2857', '51510', '+45428', '462134', 170, 207),

(374, '01', 'trevoux-01', 'TREVOUX', 'trevoux', 'Trévoux', 'T612', 'TRFKS', '01600', '427', '01427', 2, '34', 5, 6730, 6392, 6800, 1178, 5.71, 4.76667, 45.9333, '2709', '51046', '+44630', '455627', 167, 256),

(375, '01', 'bellegarde-sur-valserine', 'BELLEGARDE-SUR-VALSERINE', 'bellegarde sur valserine', 'Bellegarde-sur-Valserine', 'B42632614265', 'BLKRTSRFLSRN', '01200', '033', '01033', 4, '03', 5, 11790, 10878, 11400, 773, 15.25, 5.81667, 46.1, '3877', '51231', '+54933', '460627', 330, 1542),

(376, '01', 'bourg-en-bresse', 'BOURG-EN-BRESSE', 'bourg en bresse', 'Bourg-en-Bresse', 'B625162', 'BRKNBRS', '01000', '053', '01053', 2, '99', 3, 40088, 40628, 40200, 1680, 23.86, 5.21667, 46.2, '3213', '51339', '+51341', '461217', 220, 273),

(377, '01', 'confort', 'CONFORT', 'confort', 'Confort', 'C5163', 'KNFRT', '01200', '114', '01114', 3, '12', 6, 525, 499, 500, 45, 11.66, 5.81667, 46.15, '3874', '51278', '+54923', '460860', 375, 1621),

(378, '01', 'saint-denis-les-bourg', 'SAINT-DENIS-LES-BOURG', 'saint denis les bourg', 'Saint-Denis-lès-Bourg', 'S535242162', 'SNTTNSLSBRK', '01000', '344', '01344', 2, '43', 6, 5405, 4920, 5200, 429, 12.58, 5.2, 46.2, '3173', '51333', '+51132', '461159', 209, 242),

(379, '01', 'massignieu-de-rives', 'MASSIGNIEU-DE-RIVES', 'massignieu de rives', 'Massignieu-de-Rives', 'M253612', 'MSKNTRFS', '01300', '239', '01239', 1, '04', 6, 608, 498, 600, 63, 9.52, 5.76667, 45.75, '3812', '50838', '+54602', '454515', 220, 494),

(380, '01', 'saint-etienne-sur-chalaronne', 'SAINT-ETIENNE-SUR-CHALARONNE', 'saint etienne sur chalaronne', 'Saint-Étienne-sur-Chalaronne', 'S535262465', 'SNTTNSRXLRN', '01140', '351', '01351', 2, '32', 6, 1468, 1178, 1400, 69, 20.99, 4.86667, 46.15, '2811', '51274', '+45201', '460849', 183, 261),

(381, '01', 'bohas-meyriat-rignat', 'BOHAS-MEYRIAT-RIGNAT', 'bohas meyriat rignat', 'Bohas-Meyriat-Rignat', 'B25636253', 'BHSMRTRKNT', '01250', '245', '01245', 2, '07', 6, 811, 724, 800, 34, 23.51, 5.4, 46.1333, '3394', '51263', '+52328', '460813', 264, 555),

(382, '01', 'chevry-01', 'CHEVRY', 'chevry', 'Chevry', 'C160', 'XFR', '01170', '103', '01103', 3, '14', 6, 1235, 808, 1200, 211, 5.84, 6.03333, 46.2833, '4111', '51423', '+60213', '461651', 457, 580),

(383, '01', 'fareins', 'FAREINS', 'fareins', 'Fareins', 'F652', 'FRNS', '01480', '157', '01157', 2, '30', 6, 2137, 1668, 2000, 259, 8.22, 4.76667, 46.0167, '2694', '51133', '+44542', '460110', 167, 253),

(384, '01', 'gorrevod', 'GORREVOD', 'gorrevod', 'Gorrevod', 'G613', 'KRFT', '01190', '175', '01175', 2, '26', 6, 799, 561, 700, 116, 6.88, 4.95, 46.4167, '2894', '51573', '+45628', '462457', 172, 204),

(385, '01', 'valeins', 'VALEINS', 'valeins', 'Valeins', 'V452', 'FLNS', '01140', '428', '01428', 2, '32', 6, 88, 67, 100, 20, 4.36, 4.86667, 46.1167, '2817', '51236', '+45218', '460645', 229, 267),

(386, '01', 'vieu-d-izenave', 'VIEU-D''IZENAVE', 'vieu d izenave', 'Vieu-d''Izenave', 'V3251', 'FTSNF', '01430', '441', '01441', 4, '06', 6, 693, 536, 700, 29, 23.73, 5.53333, 46.0833, '3547', '51201', '+53145', '460451', 540, 1103),

(387, '01', 'toussieux', 'TOUSSIEUX', 'toussieux', 'Toussieux', 'T200', 'TSKS', '01600', '423', '01423', 2, '42', 6, 769, 732, 700, 162, 4.74, 4.83333, 45.9667, '2769', '51067', '+44943', '455738', 220, 281),

(388, '01', 'arbigny', 'ARBIGNY', 'arbigny', 'Arbigny', 'A6125', 'ARBKN', '01190', '016', '01016', 2, '26', 6, 399, 330, 400, 22, 17.47, 4.96667, 46.4667, '2918', '51633', '+45745', '462811', 169, 214),

(389, '01', 'malafretaz', 'MALAFRETAZ', 'malafretaz', 'Malafretaz', 'M41632', 'MLFRTS', '01340', '229', '01229', 2, '21', 6, 952, 674, 900, 103, 9.19, 5.15, 46.3167, '3122', '51471', '+50848', '461927', 190, 223),

(390, '01', 'samognat', 'SAMOGNAT', 'samognat', 'Samognat', 'S5253', 'SMKNT', '01580', '392', '01392', 4, '16', 6, 718, 421, 700, 51, 14.01, 5.58333, 46.25, '3599', '51398', '+53434', '461528', 288, 731),

(391, '01', 'cras-sur-reyssouze', 'CRAS-SUR-REYSSOUZE', 'cras sur reyssouze', 'Cras-sur-Reyssouze', 'C6262', 'KRSSRRSS', '01340', '130', '01130', 2, '21', 6, 1256, 905, 1200, 90, 13.83, 5.16667, 46.3, '3143', '51454', '+50956', '461830', 195, 229),

(392, '01', 'messimy-sur-saone', 'MESSIMY-SUR-SAONE', 'messimy sur saone', 'Messimy-sur-Saône', 'M252625', 'MSMSRSN', '01480', '243', '01243', 2, '30', 6, 1209, 932, 1200, 203, 5.95, 4.76473, 46.0484, '2698', '51165', '+44553', '460254', 168, 226),

(393, '01', 'pougny-01', 'POUGNY', 'pougny', 'Pougny', 'P250', 'PKN', '01550', '308', '01308', 3, '12', 6, 802, 628, 800, 103, 7.77, 5.95, 46.1333, '4014', '51267', '+55658', '460823', 326, 463),

(394, '01', 'sandrans', 'SANDRANS', 'sandrans', 'Sandrans', 'S53652', 'SNTRNS', '01400', '393', '01393', 2, '10', 6, 524, 416, 500, 18, 29.02, 4.98333, 46.0667, '2938', '51182', '+45851', '460350', 235, 291),

(395, '01', 'pont-de-veyle', 'PONT-DE-VEYLE', 'pont de veyle', 'Pont-de-Veyle', 'P5314', 'PNTTFL', '01290', '306', '01306', 2, '27', 5, 1593, 1485, 1500, 821, 1.94, 4.88333, 46.2667, '2835', '51404', '+45316', '461548', 172, 179),

(396, '01', 'mijoux', 'MIJOUX', 'mijoux', 'Mijoux', 'M200', 'MJKS', '01170', '247', '01247', 3, '14', 6, 379, 312, 400, 17, 22, 6, 46.3667, '4065', '51518', '+55943', '462158', 866, 1614),

(397, '01', 'saint-jean-de-gonville', 'SAINT-JEAN-DE-GONVILLE', 'saint jean de gonville', 'Saint-Jean-de-Gonville', 'S532532514', 'SNTJNTKNFL', '01630', '360', '01360', 3, '12', 6, 1496, 1201, 1400, 121, 12.36, 5.95, 46.2167, '4017', '51347', '+55707', '461246', 439, 1604),

(398, '01', 'saint-andre-le-bouchoux', 'SAINT-ANDRE-LE-BOUCHOUX', 'saint andre le bouchoux', 'Saint-André-le-Bouchoux', 'S53536412', 'SNTNTRLBXKS', '01240', '335', '01335', 2, '10', 6, 316, 191, 300, 33, 9.32, 5.08333, 46.1167, '3047', '51242', '+50443', '460702', 259, 274),

(399, '01', 'chaneins', 'CHANEINS', 'chaneins', 'Chaneins', 'C520', 'XNNS', '01990', '083', '01083', 2, '30', 6, 820, 560, 800, 64, 12.63, 4.85, 46.1, '2795', '51219', '+45107', '460548', 206, 283),

(400, '01', 'joyeux', 'JOYEUX', 'joyeux', 'Joyeux', 'J000', 'JYKS', '01800', '198', '01198', 2, '19', 6, 223, 206, 200, 13, 16.58, 5.1, 45.95, '3070', '51068', '+50558', '455740', 272, 298),

(401, '01', 'tramoyes', 'TRAMOYES', 'tramoyes', 'Tramoyes', 'T652', 'TRMYS', '01390', '424', '01424', 2, '42', 6, 1674, 1525, 1600, 129, 12.93, 4.96667, 45.8667, '2921', '50974', '+45756', '455235', 268, 307),

(402, '01', 'biziat', 'BIZIAT', 'biziat', 'Biziat', 'B230', 'BST', '01290', '046', '01046', 2, '10', 6, 797, 647, 800, 69, 11.39, 4.93333, 46.2167, '2898', '51352', '+45640', '461302', 179, 224),

(403, '01', 'izenave', 'IZENAVE', 'izenave', 'Izenave', 'I251', 'ISNF', '01430', '191', '01191', 4, '06', 6, 164, 146, 200, 12, 13.04, 5.53333, 46.0333, '3543', '51153', '+53130', '460217', 663, 1008),

(404, '01', 'belmont-luthezieu', 'BELMONT-LUTHEZIEU', 'belmont luthezieu', 'Belmont-Luthézieu', 'B453432', 'BLMNTL0S', '01260', '036', '01036', 1, '09', 6, 514, 400, 500, 25, 19.77, 5.66167, 45.8795, '3694', '50977', '+53942', '455246', 251, 1104),

(405, '01', 'arbent', 'ARBENT', 'arbent', 'Arbent', 'A6153', 'ARBNT', '01100', '014', '01014', 4, '23', 6, 3476, 3623, 3400, 147, 23.49, 5.68333, 46.3, '3716', '51439', '+54052', '461744', 435, 1100),

(406, '01', 'sutrieu', 'SUTRIEU', 'sutrieu', 'Sutrieu', 'S360', 'STR', '01260', '414', '01414', 1, '09', 6, 235, 218, 200, 12, 19.05, 5.65, 45.95, '3691', '51057', '+53932', '455705', 459, 1200),

(407, '01', 'serrieres-de-briord', 'SERRIERES-DE-BRIORD', 'serrieres de briord', 'Serrières-de-Briord', 'S623163', 'SRRSTBRRT', '01470', '403', '01403', 1, '18', 6, 1174, 960, 1100, 146, 8.03, 5.45445, 45.8081, '3464', '50898', '+52716', '454829', 200, 621),

(408, '01', 'aranc', 'ARANC', 'aranc', 'Aranc', 'A652', 'ARNK', '01110', '012', '01012', 1, '15', 6, 302, 275, 300, 13, 21.65, 5.5, 46, '3525', '51116', '+53033', '460016', 431, 1011),

(409, '01', 'chaley', 'CHALEY', 'chaley', 'Chaley', 'C400', 'XL', '01230', '076', '01076', 1, '28', 6, 127, 107, 100, 27, 4.6, 5.53333, 45.95, '3550', '51062', '+53154', '455719', 394, 910),

(410, '01', 'curciat-dongalon', 'CURCIAT-DONGALON', 'curciat dongalon', 'Curciat-Dongalon', 'C6235245', 'KRXTTNKLN', '01560', '139', '01139', 2, '29', 6, 456, 406, 400, 19, 23.94, 5.15, 46.4667, '3134', '51639', '+50927', '462830', 187, 218),

(411, '01', 'loyettes', 'LOYETTES', 'loyettes', 'Loyettes', 'L320', 'LYTS', '01360', '224', '01224', 1, '17', 6, 2645, 2331, 2400, 124, 21.28, 5.2, 45.7667, '3185', '50860', '+51211', '454627', 185, 204),

(412, '01', 'gex', 'GEX', 'gex', 'Gex', 'G000', 'JKS', '01170', '173', '01173', 3, '14', 4, 10372, 7771, 9700, 323, 32.02, 6.06667, 46.3333, '4134', '51481', '+60328', '461960', 532, 1614),

(413, '01', 'courtes', 'COURTES', 'courtes', 'Courtes', 'C632', 'KRTS', '01560', '128', '01128', 2, '29', 6, 266, 218, 300, 29, 9.06, 5.1, 46.4667, '3071', '51621', '+50601', '462733', 192, 221),

(414, '01', 'bereziat', 'BEREZIAT', 'bereziat', 'Béréziat', 'B623', 'BRST', '01340', '040', '01040', 2, '21', 6, 445, 341, 400, 41, 10.83, 5.05, 46.3667, '3010', '51519', '+50246', '462201', 185, 213),

(415, '01', 'lapeyrouse-01', 'LAPEYROUSE', 'lapeyrouse', 'Lapeyrouse', 'L162', 'LPRS', '01330', '207', '01207', 2, '35', 6, 292, 225, 300, 14, 20.04, 4.96667, 45.9833, '2933', '51092', '+45836', '455860', 277, 295),

(416, '01', 'apremont-01', 'APREMONT', 'apremont', 'Apremont', 'A1653', 'APRMNT', '01100', '011', '01011', 4, '22', 6, 363, 328, 300, 24, 14.57, 5.65833, 46.2083, '3689', '51341', '+53924', '461225', 658, 1042),

(417, '01', 'villieu-loyes-mollon', 'VILLIEU-LOYES-MOLLON', 'villieu loyes mollon', 'Villieu-Loyes-Mollon', 'V42545', 'FLLYSMLN', '01800', '450', '01450', 2, '19', 6, 3095, 2405, 2900, 194, 15.91, 5.22223, 45.9206, '3206', '51023', '+51320', '455514', 207, 323),

(418, '01', 'leyment', 'LEYMENT', 'leyment', 'Leyment', 'L530', 'LMNT', '01150', '213', '01213', 1, '17', 6, 1273, 922, 1300, 89, 14.18, 5.3, 45.9167, '3287', '51026', '+51742', '455524', 221, 321),

(419, '01', 'etrez', 'ETREZ', 'etrez', 'Étrez', 'E362', 'ETRS', '01340', '154', '01154', 2, '21', 6, 803, 642, 800, 66, 12.15, 5.18333, 46.3333, '3165', '51483', '+51105', '462003', 197, 229),

(420, '02', 'gercy', 'GERCY', 'gercy', 'Gercy', 'G620', 'JRS', '02140', '341', '02341', 5, '34', 6, 295, 314, 300, 46, 6.33, 3.86667, 49.8167, '1702', '55349', '+35206', '494850', 108, 189),

(421, '02', 'villemontoire', 'VILLEMONTOIRE', 'villemontoire', 'Villemontoire', 'V4536', 'FLMNTR', '02210', '804', '02804', 4, '24', 6, 210, 210, 200, 27, 7.65, 3.33333, 49.3, '1107', '54777', '+31958', '491757', 67, 171),

(422, '02', 'brancourt-le-grand', 'BRANCOURT-LE-GRAND', 'brancourt le grand', 'Brancourt-le-Grand', 'B6526342653', 'BRNKRTLKRNT', '02110', '112', '02112', 3, '03', 6, 619, 636, 600, 47, 13.14, 3.38333, 49.9667, '1161', '55530', '+32253', '495836', 120, 159),

(423, '02', 'licy-clignon', 'LICY-CLIGNON', 'licy clignon', 'Licy-Clignon', 'L2425', 'LSKLKNN', '02810', '428', '02428', 1, '22', 6, 87, 80, 100, 21, 4.09, 3.26667, 49.1, '1041', '54556', '+31626', '490601', 80, 165),

(424, '02', 'proisy', 'PROISY', 'proisy', 'Proisy', 'P620', 'PRS', '02120', '624', '02624', 5, '16', 6, 318, 295, 300, 61, 5.2, 3.73333, 49.9, '1559', '55442', '+34424', '495352', 105, 179),

(425, '02', 'chambry-02', 'CHAMBRY', 'chambry', 'Chambry', 'C516', 'XMR', '02000', '157', '02157', 2, '18', 6, 718, 784, 700, 80, 8.89, 3.65, 49.6, '1465', '55102', '+33919', '493529', 67, 96),

(426, '02', 'mont-saint-jean-02', 'MONT-SAINT-JEAN', 'mont saint jean', 'Mont-Saint-Jean', 'M325325', 'MNTSNTJN', '02360', '522', '02522', 5, '02', 6, 80, 76, 100, 20, 3.97, 4.2, 49.7833, '2079', '55322', '+41227', '494723', 192, 266),

(427, '02', 'morgny-en-thierache', 'MORGNY-EN-THIERACHE', 'morgny en thierache', 'Morgny-en-Thiérache', 'M625362', 'MRKNN0RX', '02360', '526', '02526', 2, '26', 6, 110, 96, 100, 15, 6.99, 4.06667, 49.7667, '1935', '55288', '+40440', '494534', 147, 217),

(428, '02', 'mesnil-saint-laurent', 'MESNIL-SAINT-LAURENT', 'mesnil saint laurent', 'Mesnil-Saint-Laurent', 'M2542534653', 'MSNLSNTLRNT', '02720', '481', '02481', 3, '40', 6, 450, 425, 400, 82, 5.45, 3.35, 49.8333, '1131', '55366', '+32117', '494946', 82, 126),

(429, '02', 'annois', 'ANNOIS', 'annois', 'Annois', 'A520', 'ANS', '02480', '019', '02019', 3, '29', 6, 383, 382, 400, 64, 5.9, 3.16667, 49.7167, '934', '55246', '+31039', '494315', 63, 158),

(430, '02', 'brunehamel', 'BRUNEHAMEL', 'brunehamel', 'Brunehamel', 'B654', 'BRNHML', '02360', '126', '02126', 2, '26', 6, 538, 509, 500, 60, 8.9, 4.18333, 49.7667, '2050', '55300', '+41055', '494611', 198, 261),

(431, '02', 'audignicourt', 'AUDIGNICOURT', 'audignicourt', 'Audignicourt', 'A325263', 'ATKNKRT', '02300', '034', '02034', 2, '11', 6, 102, 98, 100, 18, 5.66, 3.13333, 49.4833, '885', '54976', '+30800', '492842', 72, 154),

(432, '02', 'montigny-sur-crecy', 'MONTIGNY-SUR-CRECY', 'montigny sur crecy', 'Montigny-sur-Crécy', 'M32526262', 'MNTKNSRKRS', '02270', '517', '02517', 2, '13', 6, 309, 311, 300, 36, 8.53, 3.58333, 49.7167, '1387', '55240', '+33505', '494257', 55, 124),

(433, '02', 'lor', 'LOR', 'lor', 'Lor', 'L600', 'LR', '02190', '440', '02440', 2, '21', 6, 142, 122, 100, 16, 8.87, 4.05, 49.5333, '1903', '55034', '+40258', '493151', 72, 130),

(434, '02', 'chivres-en-laonnois', 'CHIVRES-EN-LAONNOIS', 'chivres en laonnois', 'Chivres-en-Laonnois', 'C1625452', 'XFRSNLNS', '02350', '189', '02189', 2, '30', 6, 367, 339, 400, 27, 13.56, 3.85, 49.6333, '1673', '55148', '+35033', '493759', 68, 116),

(435, '02', 'saint-gobain', 'SAINT-GOBAIN', 'saint gobain', 'Saint-Gobain', 'S53215', 'SNTKBN', '02410', '680', '02680', 2, '14', 6, 2337, 2340, 2300, 78, 29.73, 3.38333, 49.6, '1154', '55107', '+32230', '493545', 53, 207),

(436, '02', 'ugny-le-gay', 'UGNY-LE-GAY', 'ugny le gay', 'Ugny-le-Gay', 'U2542', 'UKNLK', '02300', '754', '02754', 2, '09', 6, 163, 166, 200, 27, 5.9, 3.16667, 49.6667, '915', '55178', '+30936', '493935', 66, 169),

(437, '02', 'happencourt', 'HAPPENCOURT', 'happencourt', 'Happencourt', 'H15263', 'HPNKRT', '02480', '367', '02367', 3, '29', 6, 148, 162, 200, 28, 5.18, 3.18333, 49.7833, '945', '55309', '+31114', '494640', 63, 101),

(438, '02', 'prouvais', 'PROUVAIS', 'prouvais', 'Prouvais', 'P612', 'PRFS', '02190', '626', '02626', 2, '21', 6, 379, 393, 400, 20, 18.22, 3.98333, 49.4667, '1820', '54960', '+35829', '492750', 72, 170),

(439, '02', 'azy-sur-marne', 'AZY-SUR-MARNE', 'azy sur marne', 'Azy-sur-Marne', 'A26565', 'ASSRMRN', '02400', '042', '02042', 1, '08', 6, 387, 381, 400, 139, 2.78, 3.36667, 49, '1144', '54446', '+32158', '490005', 57, 202),

(440, '02', 'terny-sorny', 'TERNY-SORNY', 'terny sorny', 'Terny-Sorny', 'T65265', 'TRNSRN', '02880', '739', '02739', 4, '32', 6, 304, 327, 300, 42, 7.07, 3.36667, 49.45, '1146', '54941', '+32206', '492650', 72, 163),

(441, '02', 'droizy', 'DROIZY', 'droizy', 'Droizy', 'D620', 'TRS', '02210', '272', '02272', 4, '24', 6, 75, 79, 100, 13, 5.42, 3.38333, 49.2833, '1173', '54752', '+32334', '491638', 88, 172),

(442, '02', 'pignicourt', 'PIGNICOURT', 'pignicourt', 'Pignicourt', 'P25263', 'PKNKRT', '02190', '601', '02601', 2, '21', 6, 164, 135, 100, 23, 7.01, 4.03333, 49.4167, '1882', '54906', '+40150', '492457', 55, 87),

(443, '02', 'moussy-verneuil', 'MOUSSY-VERNEUIL', 'moussy verneuil', 'Moussy-Verneuil', 'M21654', 'MSFRNL', '02160', '531', '02531', 2, '12', 6, 127, 113, 100, 19, 6.43, 3.63333, 49.4167, '1442', '54907', '+33803', '492457', 44, 160),

(444, '02', 'aguilcourt', 'AGUILCOURT', 'aguilcourt', 'Aguilcourt', 'A24263', 'AKLKRT', '02190', '005', '02005', 2, '21', 6, 349, 359, 300, 33, 10.57, 3.96667, 49.4, '1813', '54896', '+35805', '492422', 54, 102),

(445, '02', 'montaigu-02', 'MONTAIGU', 'montaigu', 'Montaigu', 'M320', 'MNTK', '02820', '498', '02498', 2, '30', 6, 732, 673, 700, 31, 23.51, 3.83333, 49.5333, '1659', '55040', '+34947', '493208', 71, 199),

(446, '02', 'moulins-02', 'MOULINS', 'moulins', 'Moulins', 'M452', 'MLNS', '02160', '530', '02530', 2, '12', 6, 99, 81, 100, 61, 1.6, 3.68333, 49.4167, '1499', '54912', '+34107', '492514', 64, 179),

(447, '02', 'saulchery', 'SAULCHERY', 'saulchery', 'Saulchery', 'S426', 'SLXR', '02310', '701', '02701', 1, '07', 6, 658, 660, 700, 250, 2.63, 3.3, 48.9833, '1079', '54416', '+31826', '485828', 57, 180),

(448, '02', 'nanteuil-la-fosse', 'NANTEUIL-LA-FOSSE', 'nanteuil la fosse', 'Nanteuil-la-Fosse', 'N3412', 'NNTLLFS', '02880', '537', '02537', 4, '32', 6, 147, 133, 100, 19, 7.36, 3.45, 49.4333, '1241', '54929', '+32712', '492609', 79, 176),

(449, '02', 'guignicourt', 'GUIGNICOURT', 'guignicourt', 'Guignicourt', 'G5263', 'KKNKRT', '02190', '360', '02360', 2, '21', 6, 2111, 2203, 2100, 118, 17.74, 3.96667, 49.4333, '1810', '54928', '+35757', '492607', 51, 142),

(450, '02', 'bucy-le-long', 'BUCY-LE-LONG', 'bucy le long', 'Bucy-le-Long', 'B2452', 'BSLLNK', '02880', '131', '02131', 4, '32', 6, 1955, 1954, 2000, 152, 12.86, 3.38333, 49.4, '1175', '54879', '+32338', '492326', 39, 161),

(451, '02', 'longpont', 'LONGPONT', 'longpont', 'Longpont', 'L52153', 'LNKPNT', '02600', '438', '02438', 4, '36', 6, 294, 294, 300, 26, 10.94, 3.21667, 49.2667, '982', '54748', '+31314', '491622', 77, 152),

(452, '02', 'montgobert', 'MONTGOBERT', 'montgobert', 'Montgobert', 'M32163', 'MNTKBRT', '02600', '506', '02506', 4, '36', 6, 198, 185, 200, 17, 11.18, 3.15, 49.3, '902', '54786', '+30854', '491825', 70, 162),

(453, '02', 'noircourt', 'NOIRCOURT', 'noircourt', 'Noircourt', 'N6263', 'NRKRT', '02340', '556', '02556', 2, '26', 6, 90, 91, 100, 16, 5.45, 4.1, 49.6667, '1951', '55187', '+40532', '494005', 122, 191);

INSERT INTO `villes_france_free` (`ville_id`, `ville_departement`, `ville_slug`, `ville_nom`, `ville_nom_simple`, `ville_nom_reel`, `ville_nom_soundex`, `ville_nom_metaphone`, `ville_code_postal`, `ville_commune`, `ville_code_commune`, `ville_arrondissement`, `ville_canton`, `ville_amdi`, `ville_population_2010`, `ville_population_1999`, `ville_population_2012`, `ville_densite_2010`, `ville_surface`, `ville_longitude_deg`, `ville_latitude_deg`, `ville_longitude_grd`, `ville_latitude_grd`, `ville_longitude_dms`, `ville_latitude_dms`, `ville_zmin`, `ville_zmax`) VALUES

(454, '02', 'rozet-saint-albin', 'ROZET-SAINT-ALBIN', 'rozet saint albin', 'Rozet-Saint-Albin', 'R23253415', 'RSTSNTLBN', '02210', '662', '02662', 1, '22', 6, 286, 292, 300, 35, 7.95, 3.3, 49.2, '1068', '54660', '+31753', '491138', 75, 184),

(455, '02', 'chivy-les-etouvelles', 'CHIVY-LES-ETOUVELLES', 'chivy les etouvelles', 'Chivy-lès-Étouvelles', 'C1423142', 'XFLSTFLS', '02000', '191', '02191', 2, '38', 6, 503, 541, 500, 142, 3.54, 3.58333, 49.5167, '1387', '55031', '+33505', '493140', 57, 79),

(456, '02', 'chavonne', 'CHAVONNE', 'chavonne', 'Chavonne', 'C150', 'XFN', '02370', '176', '02176', 4, '32', 6, 193, 180, 200, 53, 3.62, 3.56667, 49.4, '1370', '54894', '+33412', '492416', 42, 167),

(457, '02', 'artonges', 'ARTONGES', 'artonges', 'Artonges', 'A6352', 'ARTNJS', '02330', '026', '02026', 1, '10', 6, 184, 145, 200, 14, 13.12, 3.55, 48.9333, '1351', '54366', '+33310', '485545', 140, 211),

(458, '02', 'oisy-02', 'OISY', 'oisy', 'Oisy', 'O200', 'OS', '02450', '569', '02569', 5, '37', 6, 428, 417, 400, 39, 10.79, 3.66667, 50.0167, '1481', '55579', '+34010', '500116', 137, 161),

(459, '02', 'juvigny-02', 'JUVIGNY', 'juvigny', 'Juvigny', 'J125', 'JFKN', '02880', '398', '02398', 4, '31', 6, 280, 277, 300, 20, 13.85, 3.31667, 49.45, '1091', '54942', '+31906', '492651', 69, 166),

(460, '02', 'marchais-en-brie', 'MARCHAIS-EN-BRIE', 'marchais en brie', 'Marchais-en-Brie', 'M62516', 'MRXSNBR', '02540', '458', '02458', 1, '10', 6, 275, 240, 300, 21, 12.78, 3.48333, 48.8833, '1275', '54316', '+32902', '485302', 112, 212),

(461, '02', 'bouconville-vauclair', 'BOUCONVILLE-VAUCLAIR', 'bouconville vauclair', 'Bouconville-Vauclair', 'B25141246', 'BKNFLFKLR', '02860', '102', '02102', 2, '12', 6, 181, 161, 200, 13, 13.04, 3.75556, 49.4656, '1577', '54962', '+34520', '492756', 84, 207),

(462, '02', 'bouteille', 'LA BOUTEILLE', 'la bouteille', 'La Bouteille', 'L134', 'LBTL', '02140', '109', '02109', 5, '34', 6, 502, 508, 500, 26, 19, 3.96667, 49.8667, '1817', '55400', '+35819', '495134', 125, 223),

(463, '02', 'ly-fontaine', 'LY-FONTAINE', 'ly fontaine', 'Ly-Fontaine', 'L1535', 'LFNTN', '02440', '446', '02446', 3, '20', 6, 120, 86, 100, 34, 3.47, 3.3, 49.7167, '1080', '55261', '+31829', '494404', 65, 100),

(464, '02', 'logny-les-aubenton', 'LOGNY-LES-AUBENTON', 'logny les aubenton', 'Logny-lès-Aubenton', 'L25421535', 'LKNLSBNTN', '02500', '435', '02435', 5, '02', 6, 77, 73, 100, 9, 8.15, 4.2, 49.8333, '2082', '55365', '+41239', '494942', 172, 245),

(465, '02', 'cuirieux', 'CUIRIEUX', 'cuirieux', 'Cuirieux', 'C620', 'KRKS', '02350', '248', '02248', 2, '19', 6, 161, 143, 200, 24, 6.46, 3.81667, 49.6833, '1642', '55201', '+34853', '494051', 74, 121),

(466, '02', 'iron', 'IRON', 'iron', 'Iron', 'I650', 'IRN', '02510', '386', '02386', 5, '16', 6, 222, 225, 200, 23, 9.51, 3.66667, 49.95, '1471', '55505', '+33936', '495716', 110, 160),

(467, '02', 'joncourt', 'JONCOURT', 'joncourt', 'Joncourt', 'J5263', 'JNKRT', '02420', '392', '02392', 3, '06', 6, 322, 332, 300, 44, 7.25, 3.3, 49.95, '1070', '55507', '+31758', '495721', 108, 153),

(468, '02', 'effry', 'EFFRY', 'effry', 'Effry', 'E160', 'EFR', '02500', '275', '02275', 5, '17', 6, 353, 406, 400, 127, 2.77, 4, 49.9333, '1831', '55472', '+35904', '495530', 134, 223),

(469, '02', 'jumigny', 'JUMIGNY', 'jumigny', 'Jumigny', 'J525', 'JMKN', '02160', '396', '02396', 2, '12', 6, 69, 68, 100, 27, 2.49, 3.71667, 49.4167, '1534', '54902', '+34302', '492441', 55, 173),

(470, '02', 'chaourse', 'CHAOURSE', 'chaourse', 'Chaourse', 'C620', 'XRS', '02340', '160', '02160', 2, '26', 6, 535, 522, 600, 28, 18.6, 4, 49.7, '1845', '55227', '+35951', '494215', 102, 187),

(471, '02', 'saint-remy-blanzy', 'SAINT-REMY-BLANZY', 'saint remy blanzy', 'Saint-Rémy-Blanzy', 'S53651452', 'SNTRMBLNS', '02210', '693', '02693', 4, '24', 6, 234, 203, 200, 16, 13.99, 3.3, 49.2333, '1081', '54713', '+31835', '491428', 96, 208),

(472, '02', 'beaumont-en-beine', 'BEAUMONT-EN-BEINE', 'beaumont en beine', 'Beaumont-en-Beine', 'B53515', 'BMNTNBN', '02300', '056', '02056', 2, '09', 6, 161, 137, 200, 29, 5.41, 3.13333, 49.7, '884', '55208', '+30757', '494115', 72, 147),

(473, '02', 'plessier-huleu', 'LE PLESSIER-HULEU', 'le plessier huleu', 'Le Plessier-Huleu', 'L14264', 'LPLSRHL', '02210', '606', '02606', 4, '24', 6, 76, 77, 100, 14, 5.2, 3.35, 49.2333, '1120', '54710', '+32041', '491419', 132, 203),

(474, '02', 'estrees-02', 'ESTREES', 'estrees', 'Estrées', 'E2362', 'ESTRS', '02420', '291', '02291', 3, '06', 6, 416, 446, 400, 59, 7.04, 3.28333, 49.9667, '1057', '55520', '+31717', '495805', 97, 149),

(475, '02', 'baulne-en-brie', 'BAULNE-EN-BRIE', 'baulne en brie', 'Baulne-en-Brie', 'B4516', 'BLNNBR', '02330', '053', '02053', 1, '10', 6, 288, 237, 300, 15, 18.89, 3.61667, 48.9833, '1419', '54430', '+33650', '485914', 82, 243),

(476, '02', 'guivry', 'GUIVRY', 'guivry', 'Guivry', 'G160', 'KFR', '02300', '362', '02362', 2, '09', 6, 263, 221, 300, 36, 7.15, 3.11667, 49.65, '870', '55163', '+30709', '493848', 73, 180),

(477, '02', 'variscourt', 'VARISCOURT', 'variscourt', 'Variscourt', 'V6263', 'FRSKRT', '02190', '761', '02761', 2, '21', 6, 214, 109, 200, 38, 5.56, 3.98333, 49.4167, '1832', '54909', '+35908', '492504', 54, 80),

(478, '02', 'chatillon-sur-oise', 'CHATILLON-SUR-OISE', 'chatillon sur oise', 'Châtillon-sur-Oise', 'C345262', 'XTLNSRS', '02240', '170', '02170', 3, '20', 6, 129, 129, 100, 49, 2.62, 3.4, 49.7833, '1204', '55324', '+32512', '494730', 61, 119),

(479, '02', 'soissons', 'SOISSONS', 'soissons', 'Soissons', 'S520', 'SSNS', '02200', '722', '02722', 4, '99', 4, 28646, 29439, 28500, 2325, 12.32, 3.33333, 49.3667, '1096', '54868', '+31921', '492252', 38, 130),

(480, '02', 'bray-saint-christophe', 'BRAY-SAINT-CHRISTOPHE', 'bray saint christophe', 'Bray-Saint-Christophe', 'B625326231', 'BRSNTXRSTF', '02480', '117', '02117', 3, '29', 6, 80, 68, 100, 27, 2.88, 3.15, 49.7667, '897', '55301', '+30838', '494615', 66, 91),

(481, '02', 'herie-la-vieville', 'LE HERIE-LA-VIEVILLE', 'le herie la vieville', 'Le Hérie-la-Viéville', 'L6414', 'LHRLFFL', '02120', '379', '02379', 5, '27', 6, 239, 243, 200, 25, 9.27, 3.63333, 49.8167, '1454', '55358', '+33841', '494920', 82, 152),

(482, '02', 'aubenton', 'AUBENTON', 'aubenton', 'Aubenton', 'A1535', 'ABNTN', '02500', '031', '02031', 5, '02', 5, 713, 713, 700, 30, 23.7, 4.2, 49.8333, '2076', '55374', '+41217', '495012', 168, 259),

(483, '02', 'braye', 'BRAYE', 'braye', 'Braye', 'B600', 'BRY', '02880', '118', '02118', 4, '32', 6, 120, 131, 100, 89, 1.34, 3.36667, 49.4333, '1148', '54915', '+32212', '492524', 57, 148),

(484, '02', 'brissay-choigny', 'BRISSAY-CHOIGNY', 'brissay choigny', 'Brissay-Choigny', 'B625', 'BRSXKN', '02240', '123', '02123', 3, '20', 6, 317, 301, 300, 35, 8.98, 3.36667, 49.7167, '1157', '55245', '+32241', '494314', 52, 113),

(485, '02', 'remaucourt-02', 'REMAUCOURT', 'remaucourt', 'Remaucourt', 'R5263', 'RMKRT', '02100', '637', '02637', 3, '39', 6, 319, 372, 300, 50, 6.35, 3.33333, 49.9, '1116', '55440', '+32029', '495347', 78, 144),

(486, '02', 'seraucourt-le-grand', 'SERAUCOURT-LE-GRAND', 'seraucourt le grand', 'Seraucourt-le-Grand', 'S626342653', 'SRKRTLKRNT', '02790', '710', '02710', 3, '29', 6, 789, 713, 800, 74, 10.56, 3.21667, 49.7833, '974', '55311', '+31246', '494648', 67, 99),

(487, '02', 'berry-au-bac', 'BERRY-AU-BAC', 'berry au bac', 'Berry-au-Bac', 'B612', 'BRBK', '02190', '073', '02073', 2, '21', 6, 575, 528, 500, 70, 8.1, 3.9, 49.4, '1739', '54893', '+35405', '492413', 50, 91),

(488, '02', 'vivaise', 'VIVAISE', 'vivaise', 'Vivaise', 'V200', 'FFS', '02870', '821', '02821', 2, '18', 6, 768, 702, 800, 85, 9.02, 3.56667, 49.6167, '1360', '55135', '+33340', '493716', 65, 118),

(489, '02', 'proviseux-et-plesnoy', 'PROVISEUX-ET-PLESNOY', 'proviseux et plesnoy', 'Proviseux-et-Plesnoy', 'P61231425', 'PRFSKSTPLSN', '02190', '627', '02627', 2, '21', 6, 116, 102, 100, 10, 11.21, 4, 49.4667, '1859', '54961', '+40035', '492754', 73, 143),

(490, '02', 'caumont-02', 'CAUMONT', 'caumont', 'Caumont', 'C530', 'KMNT', '02300', '145', '02145', 2, '09', 6, 562, 474, 600, 98, 5.71, 3.18333, 49.6167, '934', '55146', '+31039', '493754', 56, 156),

(491, '02', 'villers-le-sec-02', 'VILLERS-LE-SEC', 'villers le sec', 'Villers-le-Sec', 'V46242', 'FLRSLSK', '02240', '813', '02813', 3, '25', 6, 277, 236, 300, 26, 10.57, 3.5, 49.7833, '1293', '55310', '+33002', '494643', 74, 134),

(492, '02', 'vichel-nanteuil', 'VICHEL-NANTEUIL', 'vichel nanteuil', 'Vichel-Nanteuil', 'V24534', 'FXLNNTL', '02210', '796', '02796', 1, '22', 6, 95, 86, 100, 14, 6.39, 3.28333, 49.1833, '1059', '54653', '+31722', '491116', 77, 173),

(493, '02', 'romery-02', 'ROMERY', 'romery', 'Romery', 'R560', 'RMR', '02120', '654', '02654', 5, '16', 6, 84, 63, 100, 21, 3.96, 3.73333, 49.9, '1542', '55441', '+34328', '495350', 102, 168),

(494, '02', 'fontaine-les-clercs', 'FONTAINE-LES-CLERCS', 'fontaine les clercs', 'Fontaine-lès-Clercs', 'F53542462', 'FNTNLSKLRKS', '02680', '320', '02320', 3, '29', 6, 289, 274, 300, 54, 5.33, 3.21667, 49.8, '985', '55340', '+31322', '494821', 67, 102),

(495, '02', 'chery-les-pouilly', 'CHERY-LES-POUILLY', 'chery les pouilly', 'Chéry-lès-Pouilly', 'C64214', 'XRLSPL', '02000', '180', '02180', 2, '13', 6, 673, 644, 700, 39, 17.22, 3.6, 49.65, '1410', '55175', '+33619', '493927', 59, 116),

(496, '02', 'pithon', 'PITHON', 'pithon', 'Pithon', 'P350', 'P0N', '02480', '604', '02604', 3, '29', 6, 75, 98, 100, 30, 2.44, 3.1, 49.75, '845', '55281', '+30550', '494511', 60, 88),

(497, '02', 'beaurieux-02', 'BEAURIEUX', 'beaurieux', 'Beaurieux', 'B620', 'BRKS', '02160', '058', '02058', 2, '12', 6, 793, 705, 800, 81, 9.69, 3.73333, 49.4, '1556', '54880', '+34413', '492332', 46, 176),

(498, '02', 'sinceny', 'SINCENY', 'sinceny', 'Sinceny', 'S525', 'SNSN', '02300', '719', '02719', 2, '09', 6, 2152, 2156, 2200, 163, 13.13, 3.25, 49.6, '1011', '55107', '+31448', '493546', 42, 113),

(499, '02', 'bouffignereux', 'BOUFFIGNEREUX', 'bouffignereux', 'Bouffignereux', 'B2562', 'BFKNRKS', '02160', '104', '02104', 2, '21', 6, 103, 110, 100, 23, 4.36, 3.85, 49.3667, '1676', '54860', '+35043', '492225', 60, 175),

(500, '02', 'saint-gengoulph', 'SAINT-GENGOULPH', 'saint gengoulph', 'Saint-Gengoulph', 'S5325241', 'SNTJNKLF', '02810', '679', '02679', 1, '22', 6, 149, 141, 100, 19, 7.57, 3.21667, 49.1167, '979', '54577', '+31304', '490710', 70, 169),

(501, '02', 'pargny-les-bois', 'PARGNY-LES-BOIS', 'pargny les bois', 'Pargny-les-Bois', 'P6254212', 'PRKNLSBS', '02270', '591', '02591', 2, '13', 6, 136, 137, 100, 19, 6.83, 3.61667, 49.7167, '1430', '55251', '+33723', '494333', 81, 137),

(502, '02', 'montigny-l-allier', 'MONTIGNY-L''ALLIER', 'montigny l allier', 'Montigny-l''Allier', 'M32546', 'MNTKNLLR', '02810', '512', '02512', 1, '22', 6, 272, 239, 300, 26, 10.14, 3.1, 49.1167, '852', '54568', '+30612', '490641', 55, 151),

(503, '02', 'beuvardes', 'BEUVARDES', 'beuvardes', 'Beuvardes', 'B632', 'BFRTS', '02130', '083', '02083', 1, '15', 6, 721, 637, 700, 46, 15.66, 3.48333, 49.15, '1281', '54602', '+32922', '490831', 131, 226),

(504, '02', 'cuissy-et-geny', 'CUISSY-ET-GENY', 'cuissy et geny', 'Cuissy-et-Geny', 'C325', 'KSTJN', '02160', '252', '02252', 2, '12', 6, 66, 59, 100, 13, 4.97, 3.7, 49.4167, '1517', '54901', '+34207', '492439', 45, 191),

(505, '02', 'reuilly-sauvigny', 'REUILLY-SAUVIGNY', 'reuilly sauvigny', 'Reuilly-Sauvigny', 'R42125', 'RLSFKN', '02850', '645', '02645', 1, '10', 6, 229, 213, 200, 35, 6.54, 3.55, 49.0667, '1376', '54505', '+33429', '490315', 62, 241),

(506, '02', 'vailly-sur-aisne', 'VAILLY-SUR-AISNE', 'vailly sur aisne', 'Vailly-sur-Aisne', 'V42625', 'FLSRSN', '02370', '758', '02758', 4, '32', 5, 2081, 2082, 2100, 208, 9.97, 3.51667, 49.4167, '1311', '54899', '+33059', '492433', 42, 192),

(507, '02', 'bievres-02', 'BIEVRES', 'bievres', 'Bièvres', 'B620', 'BFRS', '02860', '088', '02088', 2, '38', 6, 73, 76, 100, 27, 2.64, 3.71667, 49.5, '1527', '54993', '+34240', '492937', 82, 184),

(508, '02', 'berny-riviere', 'BERNY-RIVIERE', 'berny riviere', 'Berny-Rivière', 'B65616', 'BRNRFR', '02290', '071', '02071', 4, '35', 6, 613, 582, 600, 77, 7.87, 3.15, 49.4167, '893', '54896', '+30824', '492424', 36, 140),

(509, '02', 'perles', 'PERLES', 'perles', 'Perles', 'P642', 'PRLS', '02160', '597', '02597', 4, '04', 6, 80, 66, 100, 21, 3.7, 3.65, 49.3167, '1466', '54806', '+33920', '491931', 83, 179),

(510, '02', 'fontenelle-en-brie', 'FONTENELLE-EN-BRIE', 'fontenelle en brie', 'Fontenelle-en-Brie', 'F5354516', 'FNTNLNBR', '02540', '325', '02325', 1, '10', 6, 210, 171, 200, 24, 8.47, 3.48333, 48.9167, '1268', '54354', '+32841', '485507', 188, 222),

(511, '02', 'neuflieux', 'NEUFLIEUX', 'neuflieux', 'Neuflieux', 'N142', 'NFLKS', '02300', '542', '02542', 2, '09', 6, 95, 92, 100, 50, 1.9, 3.16667, 49.6, '916', '55133', '+30939', '493712', 54, 96),

(512, '02', 'sainte-croix-02', 'SAINTE-CROIX', 'sainte croix', 'Sainte-Croix', 'S53262', 'SNTKRKS', '02820', '675', '02675', 2, '12', 6, 139, 124, 100, 41, 3.35, 3.78333, 49.4833, '1603', '54979', '+34645', '492853', 101, 198),

(513, '02', 'pargny-la-dhuys', 'PARGNY-LA-DHUYS', 'pargny la dhuys', 'Pargny-la-Dhuys', 'P625432', 'PRKNLTHS', '02330', '590', '02590', 1, '10', 6, 170, 158, 200, 13, 12.66, 3.55, 48.95, '1353', '54393', '+33315', '485712', 109, 221),

(514, '02', 'brenelle', 'BRENELLE', 'brenelle', 'Brenelle', 'B654', 'BRNL', '02220', '120', '02120', 4, '04', 6, 199, 190, 200, 45, 4.34, 3.53333, 49.3667, '1341', '54851', '+33235', '492157', 60, 174),

(515, '02', 'urvillers', 'URVILLERS', 'urvillers', 'Urvillers', 'U61462', 'URFLRS', '02690', '756', '02756', 3, '20', 6, 610, 591, 600, 44, 13.69, 3.31667, 49.7833, '1081', '55322', '+31834', '494722', 72, 126),

(516, '02', 'laversine', 'LAVERSINE', 'laversine', 'Laversine', 'L1625', 'LFRSN', '02600', '415', '02415', 4, '35', 6, 152, 99, 100, 21, 7.22, 3.16667, 49.35, '926', '54835', '+31012', '492104', 54, 161),

(517, '02', 'origny-sainte-benoite', 'ORIGNY-SAINTE-BENOITE', 'origny sainte benoite', 'Origny-Sainte-Benoite', 'O625253153', 'ORKNSNTBNT', '02390', '575', '02575', 3, '25', 6, 1726, 1767, 1700, 74, 23.3, 3.5, 49.8333, '1281', '55374', '+32921', '495013', 67, 139),

(518, '02', 'cuiry-housse', 'CUIRY-HOUSSE', 'cuiry housse', 'Cuiry-Housse', 'C620', 'KRHS', '02220', '249', '02249', 4, '24', 6, 107, 110, 100, 12, 8.54, 3.48333, 49.3, '1284', '54772', '+32932', '491741', 83, 149),

(519, '02', 'neuville-les-dorengt', 'LA NEUVILLE-LES-DORENGT', 'la neuville les dorengt', 'La Neuville-lès-Dorengt', 'L514236523', 'LNFLLSTRNKT', '02450', '548', '02548', 5, '23', 6, 385, 348, 400, 35, 10.88, 3.68333, 49.9667, '1488', '55531', '+34031', '495839', 124, 176),

(520, '02', 'blanzy-les-fismes', 'BLANZY-LES-FISMES', 'blanzy les fismes', 'Blanzy-lès-Fismes', 'B452421252', 'BLNSLSFSMS', '02160', '091', '02091', 4, '04', 6, 91, 93, 100, 17, 5.27, 3.66667, 49.3333, '1485', '54821', '+34023', '492018', 80, 182),

(521, '02', 'hargicourt-02', 'HARGICOURT', 'hargicourt', 'Hargicourt', 'H6263', 'HRJKRT', '02420', '370', '02370', 3, '06', 6, 557, 559, 500, 68, 8.12, 3.18, 49.9623, '937', '55514', '+31048', '495744', 102, 151),

(522, '02', 'villers-sur-fere', 'VILLERS-SUR-FERE', 'villers sur fere', 'Villers-sur-Fère', 'V462616', 'FLRSSRFR', '02130', '816', '02816', 1, '15', 6, 486, 420, 500, 45, 10.79, 3.53333, 49.1833, '1330', '54647', '+33201', '491054', 115, 214),

(523, '02', 'herie', 'LA HERIE', 'la herie', 'La Hérie', 'L600', 'LHR', '02500', '378', '02378', 5, '17', 6, 153, 164, 200, 36, 4.22, 4.05, 49.8833, '1901', '55427', '+40253', '495302', 146, 222),

(524, '02', 'bonnesvalyn', 'BONNESVALYN', 'bonnesvalyn', 'Bonnesvalyn', 'B52145', 'BNSFLN', '02400', '099', '02099', 1, '22', 6, 242, 198, 200, 38, 6.34, 3.31667, 49.1167, '1089', '54580', '+31900', '490719', 100, 210),

(525, '02', 'haution', 'HAUTION', 'haution', 'Haution', 'H350', 'HXN', '02140', '377', '02377', 5, '34', 6, 147, 153, 100, 15, 9.34, 3.83333, 49.85, '1671', '55407', '+35025', '495159', 130, 199),

(526, '02', 'berzy-le-sec', 'BERZY-LE-SEC', 'berzy le sec', 'Berzy-le-Sec', 'B6242', 'BRSLSK', '02200', '077', '02077', 4, '41', 6, 396, 395, 400, 33, 11.69, 3.31667, 49.3333, '1085', '54816', '+31846', '492002', 52, 154),

(527, '02', 'vallee-au-ble', 'LA VALLEE-AU-BLE', 'la vallee au ble', 'La Vallée-au-Blé', 'L1414', 'LFLBL', '02140', '759', '02759', 5, '34', 6, 347, 342, 300, 67, 5.17, 3.78333, 49.8667, '1614', '55398', '+34720', '495131', 164, 186),

(528, '02', 'catelet', 'LE CATELET', 'le catelet', 'Le Catelet', 'L2343', 'LKTLT', '02420', '143', '02143', 3, '06', 5, 194, 220, 200, 473, 0.41, 3.25, 50, '1008', '55558', '+31439', '500008', 87, 108),

(529, '02', 'gizy', 'GIZY', 'gizy', 'Gizy', 'G000', 'JS', '02350', '346', '02346', 2, '30', 6, 684, 664, 700, 66, 10.25, 3.76667, 49.6, '1598', '55112', '+34628', '493602', 69, 95),

(530, '02', 'saint-algis', 'SAINT-ALGIS', 'saint algis', 'Saint-Algis', 'S5342', 'SNTLJS', '02260', '670', '02670', 5, '34', 6, 159, 146, 200, 23, 6.89, 3.81667, 49.8833, '1653', '55442', '+34926', '495352', 112, 191),

(531, '02', 'saint-aubin-02', 'SAINT-AUBIN', 'saint aubin', 'Saint-Aubin', 'S5315', 'SNTBN', '02300', '671', '02671', 2, '11', 6, 322, 273, 300, 38, 8.36, 3.18333, 49.5167, '947', '55009', '+31120', '493030', 49, 154),

(532, '02', 'bancigny', 'BANCIGNY', 'bancigny', 'Bancigny', 'B525', 'BNSKN', '02140', '044', '02044', 5, '34', 6, 28, 32, 0, 8, 3.32, 4.01667, 49.8, '1886', '55334', '+40201', '494802', 147, 216),

(533, '02', 'villeneuve-sur-fere', 'VILLENEUVE-SUR-FERE', 'villeneuve sur fere', 'Villeneuve-sur-Fère', 'V4512616', 'FLNFSRFR', '02130', '806', '02806', 1, '15', 6, 286, 231, 300, 27, 10.3, 3.46667, 49.1833, '1265', '54642', '+32830', '491039', 118, 226),

(534, '02', 'fleury-02', 'FLEURY', 'fleury', 'Fleury', 'F460', 'FLR', '02600', '316', '02316', 4, '36', 6, 129, 148, 100, 19, 6.51, 3.15639, 49.2581, '911', '54731', '+30923', '491529', 91, 191),

(535, '02', 'quincy-sous-le-mont', 'QUINCY-SOUS-LE-MONT', 'quincy sous le mont', 'Quincy-sous-le-Mont', 'Q52453', 'KNSSSLMNT', '02220', '633', '02633', 4, '04', 6, 66, 52, 100, 13, 5.04, 3.55, 49.3, '1351', '54785', '+33307', '491822', 53, 137),

(536, '02', 'besny-et-loizy', 'BESNY-ET-LOIZY', 'besny et loizy', 'Besny-et-Loizy', 'B25342', 'BSNTLS', '02870', '080', '02080', 2, '18', 6, 372, 350, 400, 38, 9.76, 3.58333, 49.6, '1383', '55111', '+33454', '493600', 72, 118),

(537, '02', 'chery-les-rozoy', 'CHERY-LES-ROZOY', 'chery les rozoy', 'Chéry-lès-Rozoy', 'C64262', 'XRLSRS', '02360', '181', '02181', 2, '26', 6, 105, 114, 100, 22, 4.73, 4.08333, 49.7167, '1949', '55245', '+40528', '494313', 127, 215),

(538, '02', 'chauny', 'CHAUNY', 'chauny', 'Chauny', 'C500', 'XN', '02300', '173', '02173', 2, '09', 5, 11983, 12512, 12100, 902, 13.28, 3.21667, 49.6167, '981', '55129', '+31309', '493656', 42, 96),

(539, '02', 'sommette-eaucourt', 'SOMMETTE-EAUCOURT', 'sommette eaucourt', 'Sommette-Eaucourt', 'S53263', 'SMTKRT', '02480', '726', '02726', 3, '29', 6, 158, 157, 100, 25, 6.28, 3.11667, 49.7333, '867', '55267', '+30702', '494423', 61, 76),

(540, '02', 'lierval', 'LIERVAL', 'lierval', 'Lierval', 'L614', 'LRFL', '02860', '429', '02429', 2, '12', 6, 115, 132, 100, 30, 3.77, 3.61667, 49.4833, '1422', '54982', '+33660', '492903', 90, 190),

(541, '02', 'chezy-sur-marne', 'CHEZY-SUR-MARNE', 'chezy sur marne', 'Chézy-sur-Marne', 'C6565', 'XSSRMRN', '02570', '186', '02186', 1, '07', 6, 1327, 1324, 1300, 59, 22.43, 3.36667, 48.9833, '1145', '54431', '+32202', '485916', 57, 220),

(542, '02', 'oulches-la-vallee-foulon', 'OULCHES-LA-VALLEE-FOULON', 'oulches la vallee foulon', 'Oulches-la-Vallée-Foulon', 'O42414145', 'OLXSLFLFLN', '02160', '578', '02578', 2, '12', 6, 63, 49, 100, 14, 4.45, 3.75, 49.4333, '1565', '54921', '+34444', '492545', 70, 194),

(543, '02', 'anizy-le-chateau', 'ANIZY-LE-CHATEAU', 'anizy le chateau', 'Anizy-le-Château', 'A52423', 'ANSLXT', '02320', '018', '02018', 2, '01', 5, 1895, 1902, 1900, 199, 9.49, 3.45, 49.5, '1238', '55007', '+32702', '493021', 52, 166),

(544, '02', 'maizy', 'MAIZY', 'maizy', 'Maizy', 'M200', 'MS', '02160', '453', '02453', 2, '21', 6, 425, 354, 400, 59, 7.09, 3.73333, 49.3833, '1553', '54863', '+34403', '492237', 46, 171),

(545, '02', 'fourdrain', 'FOURDRAIN', 'fourdrain', 'Fourdrain', 'F6365', 'FRTRN', '02870', '329', '02329', 2, '14', 6, 404, 433, 400, 42, 9.45, 3.46667, 49.6, '1261', '55123', '+32818', '493639', 57, 181),

(546, '02', 'nampteuil-sous-muret', 'NAMPTEUIL-SOUS-MURET', 'nampteuil sous muret', 'Nampteuil-sous-Muret', 'N1342563', 'NMPTLSSMRT', '02200', '536', '02536', 4, '24', 6, 85, 76, 100, 25, 3.38, 3.41667, 49.3, '1209', '54779', '+32529', '491803', 72, 171),

(547, '02', 'urcel', 'URCEL', 'urcel', 'Urcel', 'U624', 'URSL', '02000', '755', '02755', 2, '01', 6, 549, 556, 600, 76, 7.2, 3.55, 49.5, '1357', '54990', '+33329', '492929', 58, 171),

(548, '02', 'louatre', 'LOUATRE', 'louatre', 'Louâtre', 'L360', 'LTR', '02600', '441', '02441', 4, '36', 6, 213, 215, 200, 19, 11.02, 3.25, 49.25, '1011', '54730', '+31446', '491526', 77, 186),

(549, '02', 'barzy-en-thierache', 'BARZY-EN-THIERACHE', 'barzy en thierache', 'Barzy-en-Thiérache', 'B625362', 'BRSN0RX', '02170', '050', '02050', 5, '23', 6, 306, 313, 300, 40, 7.63, 3.75, 50.0333, '1566', '55604', '+34446', '500236', 152, 202);
